[
	{
		"id": 1,
		"title": "Frontend Developer",
		"company": "PwC Deutschland",
		"url": "https://www.get-in-it.de/jobsuche/p172318?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Frontend-Entwicklung - Unser Produkt ist zentraler Bestandteil der Digitalisierungsstrategie von PwC Deutschland. Unsere Lösungen sollen komplexe Probleme einfach machen, dafür brauchen wir intuitive und moderne Frontends - und die baust du! Du bist zentrale:r Ansprechpartner:in für die Frontend Entwicklung eines wichtigen internationalen Prüfungstools in einem agilen Team der Digital Factory. Du konzipierst Responsive Web-Apps mit JavaScript /TypeScript und Angular und entwickelst diese weiter. Du kannst schnell UI-Prototypen aufsetzen, aber auch robuste, skalierbare Frontends im Angular Framework für unser Tool implementieren.\n\nFachliche Expertise - Du hast bereits Erfahrung in der Entwicklung von Web Applikationen mit HTML, CSS und JavaScript/TypeScript. Moderne UI Frameworks (Angular) hast du bereits erfolgreich eingesetzt, idealerweise hast du auch schon Erfahrung mit WebSocket.\n\nAgile Mindset - Du lebst und liebst Frontend-Technologien und entwickelst so kontinuierlich Produkt, Prozesse und Zusammenarbeit weiter.\n\nTeamwork - Unsere Teams sind cross-funktional. Du arbeitest Hand in Hand mit anderen Entwickler:innen, Automation Engineers und UX Kolleg:innen an der gemeinsamen Produktvision.\n\nArbeite wie es zu deinem Leben passt: mit FlexWork. Keine fixen Home-Office-Tage, sondern deine Chance Arbeitszeit und -ort variabel zu gestalten.\nDein Profil\n\nDu verfügst über ein abgeschlossenes Studium im Bereich Informatik oder eine vergleichbare Ausbildung und bringst Berufserfahrung im IT Umfeld, insbesondere im Frontend-Bereich, mit.\n\nDu hast ein grundlegendes Verständnis von Build-Prozessen, CI/ CD, Testing. Die Testautomatisierung im Frontend-Bereich ist für dich kein Neuland.\n\nDu hast idealerweise auch Erfahrungen im User Tracking mit Hotjar oder Piwik.\n\nDu suchst ein agiles Umfeld, in dem du deine Stärken ausspielen kannst.\n\nSehr gute Deutsch- und Englischkenntnisse helfen dir dabei, deine Ideen auch im internationalen Kontext oder mit internationalen Teamkolleg:innen zu teilen.",
		"skillList": "angular, cicd, testing, hotjar, piwik",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 2,
		"title": "Frontend-Entwickler",
		"company": "networker, solutions",
		"url": "https://www.get-in-it.de/jobsuche/p197373?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Deine Aufgaben bei uns\n\n    Entwicklung von Frontend und UI-Komponenten\n    Betreuung und Weiterentwicklung bestehender Systeme\n    Zusammenarbeit mit anderen Dienstleistern an gemeinsamen Kundenprojekten\n    Umsetzung eigener Webentwicklung gemeinsam mit den Teams\n\nDeine Kompetenzen\n\n    JavaScript, Type Script\n    HTML + CSS\n    React\n    Jest Testing\n    RESTful APIs + Swagger\n    Git, Gitlab\n    Webstorm\n    NestJs\n    UX-Design",
		"skillList": "typescript, react, jest, rest, swagger, git, gitlab, webstorm, nestjs, ux",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 3,
		"title": "Web Frontend Entwickler",
		"company": "EPI development",
		"url": "https://www.get-in-it.de/jobsuche/p132078?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Die Herausforderung\n\n    Erstellung einer Bedarfsanalyse für neue Funktionen mit einer selbsterklärenden UI Gestaltung\n    Entwickeln von Funktionen und Algorithmen die nachhaltig lesbar sind\n    Der Fokus liegt in der Vereinfachung komplexer Vorgänge\n\nDeine Aufgaben\n\n    Weiterentwicklung von epirent aufgrund von aktuellen Anforderungen\n    Im Team Lösungen für neue Funktionen erarbeiten\n    Erstellen von gut bedienbaren und ausgeklügelten UI, denke wie ein Anwender\n    Kommunikation im Team, einbringen eigener Ideen\n    Offener Umgang mit neuen Technologien\n    Kreativität ist gefragt\n\nDeine Fähigkeiten\n\n    Weitreichende Erfahrungen in der Anwendungsprogrammierung\n    Klare und selbsterklärende UI Designs erstellen\n    Komplizierte technische Zusammenhänge auf einfache Funktionen herunterbrechen\n    Kommunikativ im Team, zielorientiert und selbständig in der Arbeitsorganisation\n    Deine Sprachkenntnisse (optimal): JavaScript, CSS, HTML, Bootstrap, AngularJS, API Entwicklung (REST), Responsive Design / Progressive Apps\n    Kein Hochschulabschluss notwendig, Können zählt!",
		"skillList": "angular, bootstrap, rest, responsive, pwa",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 4,
		"title": "Frontend Developer",
		"company": "reuter onlineshop",
		"url": "https://www.get-in-it.de/jobsuche/p206536?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Successfully completed studies with a focus on computer science, a similar education or relevant professional experience\nVery good knowledge in React or similar\nGood knowledge of HTML, CSS, JavaScript and Jest/Mocha\nTypeScript, Gitlab, Next.js, styled-components, Storybook and Webpack sound familiar to you\nInspire with your innovative thinking and don't lose sight of the big picture\nGet actively involved in professional discussions",
		"skillList": "react, jest, mocha, typescript, gitlab, nextjs, styledcomponents, storybook, webpack",
		"publicationDate": "2022-12-06"
	},
	{
		"id": 5,
		"title": "Frontend Developer und Consultant",
		"company": "codecentric",
		"url": "https://www.get-in-it.de/jobsuche/p206964?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Du hast ein tiefes, technisches Verständnis von Webtechnologien, wie JavaScript, TypeScript, HTML5 und CSS3 sowie Angular, ReactJS und/oder VueJS\n    Du kennst dich mit CSS-Präprozessoren und CSS-Architekturen aus\n    Du bist vertraut mit der Cross-Browser-Problematik\n    Du bist sicher im Umgang mit modernen Buildtools (z. B. Fuse-Box, Rollup, Webpack) und hast Kenntnisse aktueller Testing Frameworks (z. B. Mocha, Jasmine oder Jest)\n    Du kennst die agilen Werte und arbeitest gerne in agilen Teams\n    User Experience und Responsive Design interessieren dich\n    Beratung liegt dir und du kannst dir vorstellen, unsere Kunden technologisch oder/und methodisch zu schulen. Dafür bringst du eine hohe Kommunikationsfähigkeit und verhandlungssichere Deutschkenntnisse mit",
		"skillList": "typescript, angular, react, vue, fusebox, rollup,webpack, mocha, jasmine, jest, ux, responsive",
		"publicationDate": "2022-12-07"
	},
	{
		"id": 6,
		"title": "Praktikant/Werkstudent IT-Beratung Public Sector",
		"company": "PwC",
		"url": "https://www.stepstone.de/stellenangebote--Praktikant-Werkstudent-IT-Beratung-Public-Sector-w-m-d-Berlin-Duesseldorf-Frankfurt-a-M-Muenchen-Saarbruecken-Stuttgart-PwC--7857961-inline.html?rltr=7_7_25_seorl_m_0_0_0_0_0_0",
		"description": "Durch relevante Studienschwerpunkte oder praktische Erfahrungen hast du Grundkenntnisse in einem der folgenden Themen:\n\n- klassische Softwareentwicklung (z. B. C/C++, Java, C#),\n\n- Webentwicklung (z.B. JavaScript, Angular, React),\n\n- (Web-) Designpattern (MVC, MVVC),\n\n- Datenhaltung (z.B. SQL, noSQL, XML, JSON),\n\n- Cloud (Azure, Google, AWS, SAP),\n\n- Konzeption von IT-Architekturen/ IT-Infrastrukturen.",
		"skillList": "c, cplusplus, java, csharp, angular, react, mvc, mvvm, azure, aws, gcp, nosql, sql, xml, json, sap",
		"publicationDate": "2022-12-08"
	},
	{
		"id": 7,
		"title": "Frontend Entwickler React (Typescript)",
		"company": "ibi systems GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Frontend-Entwickler-React-Typescript-m-w-d-Regensburg-ibi-systems-GmbH--8924608-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Aufgaben\n\n    Technische Konzeption, Design und Implementierung neuer Features\n    Anpassung und kontinuierliche Optimierung bestehender Features\n    Agile Entwicklung mit Scrum und gitflow (inkl. Pull Requests)\n    Keine Scheu vor Frontend-nahen Entwicklungstätigkeiten im Backend\n    Idealerweise Umsetzung unserer UX-Designs\n\nUnser Stack\n\n    Architektur: Domain Driven Design, Microservices, Event-driven\n    Backend: .NET 6 (C#), Entity Framework Core, Hangfire, RabbitMQ\n    Frontend: React, Material UI (MUI), GraphQL (Apollo), Typescript sowie ASP.NET Web API (REST API)\n    Hosting: Docker, Kubernetes, Azure, OpenShift\n    Unit Tests mit NUnit\n    Moderne Entwicklungstools wie JetBrains Rider/WebStorm, Git und DevOps Server\n",
		"skillList": "agile, scrum, gitflow, ux, domaindrivendesign, microservices, dotnet, entityframework, hangfire, rabbitmq, react, mui, graphql, apollo, typescript, aspnet, rest, docker, kubernetes, azure, openshift, nunit, rider, webstorm, devopserver, vue, angular",
		"publicationDate": "2022-12-12"
	}
]
