[
	{
		"id": 1,
		"title": "Frontend Developer",
		"company": "PwC Deutschland",
		"url": "https://www.get-in-it.de/jobsuche/p172318?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Frontend-Entwicklung - Unser Produkt ist zentraler Bestandteil der Digitalisierungsstrategie von PwC Deutschland. Unsere Lösungen sollen komplexe Probleme einfach machen, dafür brauchen wir intuitive und moderne Frontends - und die baust du! Du bist zentrale:r Ansprechpartner:in für die Frontend Entwicklung eines wichtigen internationalen Prüfungstools in einem agilen Team der Digital Factory. Du konzipierst Responsive Web-Apps mit JavaScript /TypeScript und Angular und entwickelst diese weiter. Du kannst schnell UI-Prototypen aufsetzen, aber auch robuste, skalierbare Frontends im Angular Framework für unser Tool implementieren.\n\nFachliche Expertise - Du hast bereits Erfahrung in der Entwicklung von Web Applikationen mit HTML, CSS und JavaScript/TypeScript. Moderne UI Frameworks (Angular) hast du bereits erfolgreich eingesetzt, idealerweise hast du auch schon Erfahrung mit WebSocket.\n\nAgile Mindset - Du lebst und liebst Frontend-Technologien und entwickelst so kontinuierlich Produkt, Prozesse und Zusammenarbeit weiter.\n\nTeamwork - Unsere Teams sind cross-funktional. Du arbeitest Hand in Hand mit anderen Entwickler:innen, Automation Engineers und UX Kolleg:innen an der gemeinsamen Produktvision.\n\nArbeite wie es zu deinem Leben passt: mit FlexWork. Keine fixen Home-Office-Tage, sondern deine Chance Arbeitszeit und -ort variabel zu gestalten.\nDein Profil\n\nDu verfügst über ein abgeschlossenes Studium im Bereich Informatik oder eine vergleichbare Ausbildung und bringst Berufserfahrung im IT Umfeld, insbesondere im Frontend-Bereich, mit.\n\nDu hast ein grundlegendes Verständnis von Build-Prozessen, CI/ CD, Testing. Die Testautomatisierung im Frontend-Bereich ist für dich kein Neuland.\n\nDu hast idealerweise auch Erfahrungen im User Tracking mit Hotjar oder Piwik.\n\nDu suchst ein agiles Umfeld, in dem du deine Stärken ausspielen kannst.\n\nSehr gute Deutsch- und Englischkenntnisse helfen dir dabei, deine Ideen auch im internationalen Kontext oder mit internationalen Teamkolleg:innen zu teilen.",
		"skillList": "angular, cicd, testing, hotjar, piwik",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 2,
		"title": "Frontend-Entwickler",
		"company": "networker, solutions",
		"url": "https://www.get-in-it.de/jobsuche/p197373?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Deine Aufgaben bei uns\n\n    Entwicklung von Frontend und UI-Komponenten\n    Betreuung und Weiterentwicklung bestehender Systeme\n    Zusammenarbeit mit anderen Dienstleistern an gemeinsamen Kundenprojekten\n    Umsetzung eigener Webentwicklung gemeinsam mit den Teams\n\nDeine Kompetenzen\n\n    JavaScript, Type Script\n    HTML + CSS\n    React\n    Jest Testing\n    RESTful APIs + Swagger\n    Git, Gitlab\n    Webstorm\n    NestJs\n    UX-Design",
		"skillList": "typescript, react, jest, rest, swagger, git, gitlab, webstorm, nestjs, ux",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 3,
		"title": "Web Frontend Entwickler",
		"company": "EPI development",
		"url": "https://www.get-in-it.de/jobsuche/p132078?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Die Herausforderung\n\n    Erstellung einer Bedarfsanalyse für neue Funktionen mit einer selbsterklärenden UI Gestaltung\n    Entwickeln von Funktionen und Algorithmen die nachhaltig lesbar sind\n    Der Fokus liegt in der Vereinfachung komplexer Vorgänge\n\nDeine Aufgaben\n\n    Weiterentwicklung von epirent aufgrund von aktuellen Anforderungen\n    Im Team Lösungen für neue Funktionen erarbeiten\n    Erstellen von gut bedienbaren und ausgeklügelten UI, denke wie ein Anwender\n    Kommunikation im Team, einbringen eigener Ideen\n    Offener Umgang mit neuen Technologien\n    Kreativität ist gefragt\n\nDeine Fähigkeiten\n\n    Weitreichende Erfahrungen in der Anwendungsprogrammierung\n    Klare und selbsterklärende UI Designs erstellen\n    Komplizierte technische Zusammenhänge auf einfache Funktionen herunterbrechen\n    Kommunikativ im Team, zielorientiert und selbständig in der Arbeitsorganisation\n    Deine Sprachkenntnisse (optimal): JavaScript, CSS, HTML, Bootstrap, AngularJS, API Entwicklung (REST), Responsive Design / Progressive Apps\n    Kein Hochschulabschluss notwendig, Können zählt!",
		"skillList": "angular, bootstrap, rest, responsive, pwa",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 4,
		"title": "Frontend Developer",
		"company": "reuter onlineshop",
		"url": "https://www.get-in-it.de/jobsuche/p206536?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Successfully completed studies with a focus on computer science, a similar education or relevant professional experience\nVery good knowledge in React or similar\nGood knowledge of HTML, CSS, JavaScript and Jest/Mocha\nTypeScript, Gitlab, Next.js, styled-components, Storybook and Webpack sound familiar to you\nInspire with your innovative thinking and don't lose sight of the big picture\nGet actively involved in professional discussions",
		"skillList": "react, jest, mocha, typescript, gitlab, nextjs, styledcomponents, storybook, webpack",
		"publicationDate": "2022-12-06"
	},
	{
		"id": 5,
		"title": "Frontend Developer und Consultant",
		"company": "codecentric",
		"url": "https://www.get-in-it.de/jobsuche/p206964?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Du hast ein tiefes, technisches Verständnis von Webtechnologien, wie JavaScript, TypeScript, HTML5 und CSS3 sowie Angular, ReactJS und/oder VueJS\n    Du kennst dich mit CSS-Präprozessoren und CSS-Architekturen aus\n    Du bist vertraut mit der Cross-Browser-Problematik\n    Du bist sicher im Umgang mit modernen Buildtools (z. B. Fuse-Box, Rollup, Webpack) und hast Kenntnisse aktueller Testing Frameworks (z. B. Mocha, Jasmine oder Jest)\n    Du kennst die agilen Werte und arbeitest gerne in agilen Teams\n    User Experience und Responsive Design interessieren dich\n    Beratung liegt dir und du kannst dir vorstellen, unsere Kunden technologisch oder/und methodisch zu schulen. Dafür bringst du eine hohe Kommunikationsfähigkeit und verhandlungssichere Deutschkenntnisse mit",
		"skillList": "typescript, angular, react, vue, fusebox, rollup,webpack, mocha, jasmine, jest, ux, responsive",
		"publicationDate": "2022-12-07"
	},
	{
		"id": 6,
		"title": "Praktikant IT-Beratung Public Sector",
		"company": "PwC",
		"url": "https://www.stepstone.de/stellenangebote--Praktikant-Werkstudent-IT-Beratung-Public-Sector-w-m-d-Berlin-Duesseldorf-Frankfurt-a-M-Muenchen-Saarbruecken-Stuttgart-PwC--7857961-inline.html?rltr=7_7_25_seorl_m_0_0_0_0_0_0",
		"description": "Durch relevante Studienschwerpunkte oder praktische Erfahrungen hast du Grundkenntnisse in einem der folgenden Themen:\n\n- klassische Softwareentwicklung (z. B. C/C++, Java, C#),\n\n- Webentwicklung (z.B. JavaScript, Angular, React),\n\n- (Web-) Designpattern (MVC, MVVC),\n\n- Datenhaltung (z.B. SQL, noSQL, XML, JSON),\n\n- Cloud (Azure, Google, AWS, SAP),\n\n- Konzeption von IT-Architekturen/ IT-Infrastrukturen.",
		"skillList": "c, cplusplus, java, csharp, angular, react, mvc, mvvm, azure, aws, gcp, nosql, sql, xml, json, sap",
		"publicationDate": "2022-12-08"
	},
	{
		"id": 7,
		"title": "Frontend Entwickler React Typescript",
		"company": "ibi systems GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Frontend-Entwickler-React-Typescript-m-w-d-Regensburg-ibi-systems-GmbH--8924608-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Aufgaben\n\n    Technische Konzeption, Design und Implementierung neuer Features\n    Anpassung und kontinuierliche Optimierung bestehender Features\n    Agile Entwicklung mit Scrum und gitflow (inkl. Pull Requests)\n    Keine Scheu vor Frontend-nahen Entwicklungstätigkeiten im Backend\n    Idealerweise Umsetzung unserer UX-Designs\n\nUnser Stack\n\n    Architektur: Domain Driven Design, Microservices, Event-driven\n    Backend: .NET 6 (C#), Entity Framework Core, Hangfire, RabbitMQ\n    Frontend: React, Material UI (MUI), GraphQL (Apollo), Typescript sowie ASP.NET Web API (REST API)\n    Hosting: Docker, Kubernetes, Azure, OpenShift\n    Unit Tests mit NUnit\n    Moderne Entwicklungstools wie JetBrains Rider/WebStorm, Git und DevOps Server\n",
		"skillList": "agile, scrum, gitflow, ux, domaindrivendesign, microservices, dotnet, entityframework, hangfire, rabbitmq, react, mui, graphql, apollo, typescript, aspnet, rest, docker, kubernetes, azure, openshift, nunit, rider, webstorm, devopserver, vue, angular",
		"publicationDate": "2022-12-12"
	},
	{
		"id": 8,
		"title": "Fullstack developer React framework",
		"company": "ALTEN GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Fullstack-developer-m-f-d-React-framework-Munich-ALTEN-GmbH--8995148-inline.html?rltr=15_15_25_seorl_m_0_0_0_0_1_0",
		"description": "\n    Successfully completed studies in computer science, electrical engineering  or similar\n    Relevant years of work experience as a Full Stack Engineer and have built and operated an application in production in the past, preferably in the area of e-commerce\n    Developing applications with React, modern JavaScript standards (ES6/ES7), HTML5 and CSS\n    Practical experiences with NoSQL data bases like MongoDB\n    Comfortable with building, deploying and operating your application as micro services in a cloud infrastructure\n    Very good knowledge of English\n",
		"skillList": "react, mongodb, microservices, cloud",
		"publicationDate": "2022-12-13"
	},
	{
		"id": 9,
		"title": "Junior-Softwareentwickler:in",
		"company": "Qnips GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Junior-Softwareentwickler-in-Hannover-Qnips-GmbH--7783712-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Du bringst viel Interesse an modernen IT-Systemen, neuen Frameworks & Programmiersprachen mit \nDu bist fit in der Programmierung und fühlst dich in einem der nachfolgenden Bereiche wohl. Wir finden den passenden Tech-Stack für dich! \n\n    Android: Kotlin und Jetpack Compose \n     iOS: Swift und Swift UI \n     Backend Development: C#, .NET, Google Firebase, Cloud functions \n     Hybride App Development: Flutter mit Dart \n     Web Development: Angular, TypeScript-Framworks\n\nIdealerweise besitzt Du Kenntnisse im Umgang mit (RESTful-) Webservices sowie Git als Versionsverwaltung.  \nDu hast ein großes Herz für gute User Experience, durchdachtes Interface Design oder state-of-the-art API-Design ",
		"skillList": "kotlin, jetpackcompose, swift, csharp, dotnet, firebase, flutter, dart, angular, rest, git",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 10,
		"title": "Backend Developer Node/Typescript",
		"company": "Interhyp Gruppe",
		"url": "https://www.stepstone.de/stellenangebote--Backend-Developer-Typescript-Node-JS-m-w-d-Muenchen-Interhyp-Gruppe--9006012-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_0_0",
		"description": " wir dich unbedingt brauchen, da du unsere digitalen Produkte entwickelst – mit Technologien wie z. B. Typescript, Node.JS, Express, MongoDB, Rest.\n\n… unsere Product Owner voll und ganz auf dich als kompetente*n Ansprechpartner*in zählen.\n\n… wir nicht genug von deinem Feedback zu den User Storys kriegen können und du uns dabei hilfst, ein herausragendes Produkt für unsere Kund*innen zu schaffen.\n\n… du immer und immer wieder deine eigenen Ideen einbringst, um damit Qualität, technische Verbesserungen sowie neue Features voranzutreiben.\nUnd du passt perfekt zu uns, denn...\n\n… du hast mindestens zwei Jahre relevante Erfahrung in der Arbeit mit schnell skalierenden und komplexen Systemen.\n\n… über umfassende Erfahrung mit Typescript, Node.JS verfügst du bereits und besitzt idealerweise schon praktische Erfahrung mit Express, MongoDB, Rest.\n\n… als Teamplayer schlägt dein Herz dafür, Feedback zu erhalten und zu geben, um sowohl persönlich als auch als Software Engineer (m/w/d) zu wachsen.\n\n… du handelst lösungsorientiert, übernimmst aktiv Verantwortung und stellst dich gern neuen Herausforderungen.",
		"skillList": "typescript, node, express, mongodb, rest",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 11,
		"title": "Full Stack Developer",
		"company": "ASAMBEAUTY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-m-w-d-Unterfoehring-Muenchen-ASAMBEAUTY-GmbH--8963596-inline.html?rltr=3_3_25_seorl_m_0_0_0_0_1_0",
		"description": "    Abgeschlossene Ausbildung als IT-Systemelektroniker, Fachinformatiker oder eine vergleichbare Ausbildung\n    3-5 Jahre Erfahrung als Full Stack-Entwickler oder eine ähnliche Funktion\n    Erfahrung in der Arbeit mit Shopsystemen, hauptsächlich Magento 2\n    Erfahrung in der Entwicklung von Desktop- und mobilen Anwendungen\n    Kenntnisse mehrerer Front-End-Sprachen und Bibliotheken (z.B. HTML/CSS, JavaScript, XML, jQuery)\n    Kenntnisse in mehreren Back-End-Sprachen, hauptsächlich PHP und JavaScript-Frameworks (z.B. Angular, React, Node.js)\n    Vertrauter Umgang mit Datenbanken (z.B. MySQL), Web-Servern (z.B. Apache, NGINX) und UI/UX-Design\n    Vertrauter Umgang mit Cloud-Hosting (AWS)\n    Erste Erfahrungen in anderen Bereichen von eCommerce-Plattformen wie Zahlung, Produktdaten, Auftragsverwaltung, Webanalyse, Inhaltsverwaltung, Werbung, Suche usw.\n    Erste Erfahrungen mit dem Lebenszyklus in einer agilen / Scrum-Umgebung",
		"skillList": "magento, xml, jquery, php, angular, react, node, mysql, apache, nginx, ux, aws, scrum",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 12,
		"title": "Machine Learning Engineer",
		"company": "HDP-Gesellschaft für ganzheitliche Datenverarbeitung mbH",
		"url": "https://www.stepstone.de/stellenangebote--Machine-Learning-Engineer-m-w-d-Alzey-HDP-Gesellschaft-fuer-ganzheitliche-Datenverarbeitung-mbH--8076473-inline.html?rltr=14_14_25_seorl_m_0_0_0_0_0_0",
		"description": "\n    Die Erfüllung der Aufgaben setzt ein abgeschlossenes Studium im MINT-Bereich voraus.\n    Des Weiteren werden Kenntnisse im Bereich Machine Learning sowie fortgeschrittene Programmierkenntnisse in einer objektorientierten Sprache (bevorzugt Python) vorausgesetzt.\n    Erfahrungen mit einschlägigen Frameworks und Werkzeugen zu Machine Learning und dem Python Scientific Stack sind wünschenswert (z.B. scikit-learn, TensorFlow, PyTorch).\n    Idealerweise verfügen Sie über Erfahrungen im Bereich Software Engineering und Testen.\n    Ein hohes Qualitätsbewusstsein, eine ausgeprägte Innvoations- und Lernbereitschaft sowie Eigeninitiative zeichnet Sie und Ihren Arbeitsstil aus.\n    Als zielorientierte Persönlichkeit gehen Sie analytisch vor und lösen Problemstellungen strukturiert.\n    Sie sind ein engagierter Teamplayer, bringen sich gerne ein und sind offen für Neues.\n",
		"skillList": "mint, machinelearning, python, oop, pythonsciencestack, scikitlearn, tensorflow, pytorch, testing",
		"publicationDate": "2022-12-15"
	},
	{
		"id": 13,
		"title": "Entwickler React / Cloud",
		"company": "itdesign GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Remote-Software-Developer-Entwickler-React-Cloud-m-w-d-Tuebingen-bei-Stuttgart-Zwickau-Mainz-itdesign-GmbH--8056768-inline.html?rltr=12_12_25_seorl_m_0_0_0_0_0_0",
		"description": "Das tun wir\n\n    Im Scrum Team konzipieren wir die Architektur und implementieren Features\n    Durch Code Review und Remote Pair Programming stellen wir die Code-Qualität sicher\n    Wir deployen die Microservices des Teams\n    Wir tauschen uns täglich über Herausforderungen und technische Trends über Collaborations Tools aus und lernen voneinander und miteinander\n\nDas bist du\n\n    In den Bereichen Softwarearchitektur, Web-Applikationen oder Server-Client-Systeme fühlst du dich wohl\n    Moderne JavaScript Frameworks, z.B. React, Vue, Angular oder Backend-Technologien wie Spring Boot sind deine Leidenschaft\n    Du brauchst beim Programmieren Ruhe und kannst dich zu Hause am besten konzentrieren\n    Du willst auch remote Teil eines unschlagbaren Teams sein\n\n",
		"skillList": "scrum, codereview, pairprogramming, microservices, react, vue, angular, springboot",
		"publicationDate": "2022-12-16"
	},
	{
		"id": 14,
		"title": "Full Stack Developer",
		"company": "klarsolar GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-m-w-d-Heidelberg-klarsolar-GmbH--8864165-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Deine Aufgaben:\n\n    Als aktiver Teil des Entwicklungsteams arbeitest du eigenverantwortlich an Softwarelösungen\n    Technische Best Practices wie Serverless, CQRS, Microservices und Micro Frontends kennst du wie deine Westentasche und setzt mit ihnen agile Anforderungsbeschreibungen aus User Stories und Use Cases in geeignete Softwarekomponenten um\n    Deine Aufgaben erstrecken sich über den gesamten Stack einer Applikation (Angular, GrapQL, NestJS)\n    Zur automatisierten Auslieferung von Software-Artefakten, setzt du Test-Cases in Test-Code um, damit eine Ergebnissicherung der Anwendung für das Team gewährleistet ist\n\nDein Profil:\n\n    Du bringst Erfahrungen in Frontend und Backend-Entwicklung mit Javascript, HTML, Node.js, Angular, GraphQL, Tailwind mit\n    In Projektteams findest du dich schnell zurecht, da du gut organisiert bist und das interdisziplinäre Arbeiten schätzt\n    Du bist erfahren in min. einem CI/CD Werkzeug (bspw. Git Hub Actions)\n    Du hast Kenntnisse in einem IaaS-Anbieter (z.B. Azure, AWS, Google..)\n    Du hast Kenntnisse der gängigen Cloud-Anwendungsplattformen (z.B. Docker,Kubernetes)\n    Du hast ein agiles Mindset, bist kollegial und ergebnisorientiert\n",
		"skillList": "serverless, cqrs, microservices, microfrontends, angular, graphql, nestjs, node, tailwind, cicd, githubactions, azure, aws, gcp, docker, kubernetes, agile",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 15,
		"title": "Frontend Entwickler",
		"company": "Bertelsmann",
		"url": "https://www.get-in-it.de/jobsuche/p204395?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Wir suchen Dich, denn Du bist motiviert und engagiert und hast Lust gemeinsam mit uns unsere neue Lernplattform stetig weiterzuentwickeln und zu optimieren.\n\nZudem bringst Du Folgendes mit:\n\n    Ein abgeschlossenes IT-Studium (Informatik, Wirtschaftsinformatik), eine Ausbildung als Fachinformatiker (m/w/d) oder eine vergleichbare Qualifikation\n    Mindestens drei Jahre Berufserfahrung in der Umsetzung von Web-Anwendungen\n    Fundierte Kenntnisse in ReactJS, TailwindCSS oder ein anderes CSS-Framework\n    Erfahrung mit Jest, CI/CD, Docker oder Nginx sind ein Plus\n    Eine strukturierte, selbstständige und zielorientierte Arbeitsweise\n    Verhandlungssichere Deutsch- und Englischkenntnisse",
		"skillList": "react, tailwind, jest, cicd, docker, nginx",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 16,
		"title": "Frontend Developer",
		"company": "modis",
		"url": "https://www.get-in-it.de/jobsuche/p207871?start=0&limit=39&ref=Jobsuche",
		"description": "    Sie bringen ein abgeschlossenes Studium oder eine Ausbildung im Bereich der Webentwicklung mit\n    Kenntnisse in HTML, CSS, JavaScript und React zeichnen Sie aus\n    Sie verfügen über Erfahrungen mit der Anbindung von Micro-bzw. Backend-Services (unter anderem REST)\n    Auch in den Bereichen Node.js-Ökosystem und moderne Build-Prozesse kennen Sie sich aus\n    Zudem besitzen Sie Kenntnisse im Umgang mit TypeScript, Fluent UI, Docker und Java\n    Abgerundet wird Ihr Profil dadurch, dass Sie ein Teamplayer sind und sich mit Engagement im Team einbringen",
		"skillList": "react, rest, node, typescript, fluentui, docker, java",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 17,
		"title": "Backend Developer TypeScript",
		"company": "snapADDY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Backend-Developer-TypeScript-NestJS-PostgreSQL-m-w-d-97070-Wuerzburg-snapADDY-GmbH--8962220-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Your profile\n\n    Passion for software development in the area of APIs, Databases and Backend\n    Collaborating with other developers and departments is enjoyable for you\n    Experience with modern JavaScript and TypeScript or willingness to learn\n    Structured, analytical, and independent way of working\n    An open and friendly personality who enjoys working with colleagues as part of a team\n\nOur technologies:\n\n    Development in JavaScript and TypeScript\n    Backend: NodeJS, NestJS, TypeORM, PostgreSQL, Redis\n    Tools: GitHub with ZenHub, Slack, Github Actions, Ionic AppFlow\n    Hosting: Amazon Web Services (AWS), Lambda Functions, Kubernetes\n\nNice-to-have\n\n    Experience with Amazon Web Services (AWS)\n    Knowledge about APIs and Integrations of B2B applications like Salesforce or Microsoft Dynamics\n",
		"skillList": "rest, typescript, node, nestjs, typeorm, postgres, redis, zenhub, githubactions, ionicappflow, aws, awslambda, kubernetes, salesforce, microsoftdynamics",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 18,
		"title": "Full Stack Webentwickler",
		"company": "Alevino",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Webentwickler-m-w-d-bundesweit-Alevino--8954447-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Du bist ein Vollblut-Techie (m/w/d) mit einiger Erfahrung im Bereich Webentwicklung. Ideal sind\n\n    Praktische Erfahrungen im Bereich der Frontend-Entwicklung mit modernen Webtechnologien (HTML, CSS, Javascript), SPA-Frameworks (insbesondere React.js) und Progressive Web Apps (PWAs).\n    Kenntnisse der Backend-Entwicklung in Javascript bzw. Typescript mit Node.js (z. B. mit Nest.js) und gängigen Datenbanken (insbesondere PostgreSQL und Mongo DB)\n    Vertrautheit mit einschlägigen Konzepten wie Microservice-Architekturen und REST-Schnittstellen\n    Sicherer Umgang in der Versionsverwaltung mit Git und Erfahrungen im Bereich CI/CD mit Github oder Gitlab\n    Kenntnisse von Containerisierung und dem Betrieb von Anwendungen im Cloud-Umfeld (z. B. AWS), gerne auch mit Serverless-Computing-Ansätzen.\n    Bereitschaft Betriebsverantwortung im Sinne des DevOps zu übernehmen – „You build it, you run it“",
		"skillList": "react, pwa, typescript, node, nestjs, postgres, mongodb, rest, cicd, github, gitlab, aws, serverless, devops",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 19,
		"title": "Frontend Developer",
		"company": "toom Baumarkt GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Frontend-Developer-Cross-Channel-E-Commerce-m-w-d-51149-Koeln-toom-Baumarkt-GmbH-Ein-Unternehmen-der-REWE-Group--9028936-inline.html?rltr=2_2_25_seorl_m_1_0_0_0_1_0",
		"description": "Technologien: \n\nJavaScript | TypeScript | HTML | CSS | React | REST/GraphQL | Kubernetes | Gitlab CI/CD\n\nDeine Aufgaben: \n\n    Dein Fokus liegt auf der Entwicklung und Implementierung moderner und nutzerzentrierter Webanwendungen\n    Für deine Entwicklung nutzt du unsere Pattern Library basierend auf Atomic Design \n    Unserer Softwarearchitektur gestaltest du aktiv mit \n    Für die Einhaltung von Architekturvorgaben, die Wartbarkeit und Wiederverwendbarkeit der Komponenten sowie die Qualitätssicherungsmaßnahmen übernimmst du die Verantwortung \n    Neue Produktanforderungen werden von Dir analysiert und in unsere Gesamtarchitektur integriert \n    Du blickst über den Tellerrand und bringst neue Ideen und Technologien aus dem Bereich Webentwicklung ein \n    Du beteiligst Dich regelmäßig und aktiv daran, die Zusammenarbeit in unserem agilen Arbeitsumfeld zu verbessern \n\nDein Profil\n\nDas bringst du mit:\n\n    Leidenschaft für nachhaltige Software-Entwicklung und Clean-Code \n    Mehrjährige Berufserfahrung in objektorientierter Entwicklung von Webanwendungen \n    Idealerweise ein Studium der (angewandten) Informatik bzw. Wirtschaftsinformatik oder ein anderer überzeugender Werdegang \n    Fundierte Kenntnisse in JavaScript und/oder TypeScript, HTML und CSS  \n    Praktische Erfahrung mit JavaScript Frameworks/ Microfrontend-Architekturen wie VueJS, React oder Angular \n    Kenntnisse im Umgang und Aufsetzen automatisierter Tests (z.B. Cypress) \n    Expertise in der Schnittstellendefinition (REST, OpenAPI, Swagger, ...) \n    Routine im Umgang mit Versionsverwaltungssystemen und Build-Pipelines (Git, Gitlab) \n    Freude an agiler Zusammenarbeit \n    Sehr gute Deutschkenntnisse und gute Englischkenntnisse \n",
		"skillList": "typescript, react, rest, graphql, kubernetes, gitlab, cicd, cleancode, oop, vue, angular, cypress, openapi, swagger, git, agile",
		"publicationDate": "2022-12-18"
	},
	{
		"id": 20,
		"title": "React Developer",
		"company": "NETCONOMY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--React-Developer-m-f-d-Dortmund-Berlin-NETCONOMY-GmbH--8377095-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Your Job\n\n    You contribute in developing high performance web solutions within our agile and cross-functional teams\n    You work across the entire web stack with modern web frameworks such as React, Redux, GraphQL, Node.js, SASS and TypeScript\n    You build experiences for customers by optimizing the usability and UX\n    You effectively support with browser and performance optimization\n    You successfully implement responsive designs and ensure cross-browser compatibility\n    You proactively assist with the evaluation and introduction of innovative frontend technologies\n\nYour Skills\n\n    You have at least 3 years of experience working as a Frontend Developer or in a similar role\n    You have experience / relevant background in web development with Javascript/ES6 (React)\n    You are familiar with a variety of web browsers and their compatibility issues\n    You know how to use modern development tools, such as JIRA, Confluence, Git, Jenkins\n    You have practical experience with accessibility, performance analysis and usability\n    Your knowledge of concepts like Server-Side Rendering and Progressive Web Apps is solid\n    You have excellent English skills (B2/C1), German skills are beneficial\n\n",
		"skillList": "react, redux, graphql, node, sass, typescript, ux, jira, confluence, git, jenkins, ssr, pwa",
		"publicationDate": "2022-12-18"
	},
	{
		"id": 21,
		"title": "TypeScript Developer",
		"company": "meetergo GmbH",
		"url": "https://www.stepstone.de/stellenangebote--TypeScript-Developer-m-w-d-Koeln-meetergo-GmbH--8168170-inline.html?rltr=1_1_25_seorl_m_0_0_0_0_1_0",
		"description": "Bei uns kannst Du Deine großartigen Tech Skills voll zum Einsatz bringen. Sag uns, was Du drauf hast und wir finden gemeinsam mit Dir Deinen Best-fitting-place in unserem agilen Entwickler-Team. Mindestens mit 2 bis 3 der folgenden Technologien solltest Du Dich richtig gut auskennen:\n\n    Modernes Typescript\n    React / NextJS / Remix / Chakra UI / Material UI (Frontend)\n    React Native (Native)\n    NestJS / TypeORM / Postgres (Backend-API)\n    LiveKit (P2P-Videoplattform)\n    WebSockets / Socket.io / Redis / LiveKit SDK (Backend-Realtime-Comms)\n    AWS / Terraform / Docker / Kubernetes (Infrastruktur)\n    Nx (Monorepo)\n    Webpack / Babel / Nx (Build Tools)\n    Gitlab/Circle CI (CI)\n    Jest / React Testing Library / Testcafe / Cypress / Supertest (Testing)\n",
		"skillList": "react, nextjs, remix, typescript, chakraui, mui, reactnative, nestjs, typeorm, postgres, livekit, socketio, redis, aws, terraform, docker, kubernetes, nx, webpack, babel, gitlab, circleci, jest, reacttestinglibrary, testcafe, cypress, supertest",
		"publicationDate": "2022-12-19"
	},
	{
		"id": 22,
		"title": "Softwareentwickler Frontend DevOps",
		"company": "Deutsche Bahn",
		"url": "https://www.get-in-it.de/jobsuche/p174488?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Du hast ein (Fach-)Hochschulstudium in (Wirtschafts-)Informatik oder einer vergleichbaren Fachrichtung abgeschlossen oder verfügst über eine Ausbildung im IT-Bereich\n    Du bist Experte in der Entwicklung mit JavaScript/TypeScript und React und hast Erfahrung im Umgang mit Komponentenbibliotheken wie Chakra UI\n    Automatisierte Tests, UX und Accessibility sind für dich unverzichtbar neue Technologien setzt du im Sinne der Kundenorientierung zum Wohle der Anwendenden ein\n    Du hast Lust darauf, dein Know how in für ein DevOps-Team wichtigen Themenfeldern wie Continuous Integration und Continuous Delivery auf- und auszubauen\n    Spaß an neuen Technologien, ein hohes Maß an Wissbegierde und Lernbereitschaft zeichnen dich aus und du sprichst fließend Deutsch",
		"skillList": "typescript, react, chakraui, testing, ux, devops, cicd",
		"publicationDate": "2022-12-20"
	},
	{
		"id": 23,
		"title": "Frontend-Entwickler",
		"company": "dotSource",
		"url": "https://www.get-in-it.de/jobsuche/p13958?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Erfolgreiches Informatikstudium oder eine vergleichbare technische Qualifikation/Ausbildung\n    Professioneller Umgang mit Technologien, wie bspw. HTML5, CSS3 (SASS, LESS), JavaScript und Frameworks wie AngularJS, vueJS oder React\n    Gute Kenntnisse in den Bereichen Browser-Kompatibilität, Responsive Webdesign und CMS\n    Vorteilsweise Kenntnisse in User-Experience (UX) und Webdesign\n    Grundkenntnisse in Java und/oder PHP sowie in verschiedenen Template-Engines",
		"skillList": "sass, angular, vue, react, responsive, ux, java, php",
		"publicationDate": "2022-12-21"
	},
	{
		"id": 24,
		"title": "React Frontend Developer",
		"company": "proWIN Winter GmbH",
		"url": "https://www.stepstone.de/stellenangebote--React-Frontend-Developer-m-w-d-Illingen-proWIN-Winter-GmbH--9044500-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Ihre Aufgaben\n\n    Sie planen und entwickeln Frontend Applikationen im agilen Projektumfeld unter Berücksichtigung von Best Practices und unseren Sicherheits- und Qualitätsanforderungen\n    Sie entwickeln mit Hilfe von Designrichtlinien Web- und Mobile- Applikationen eigenständig und im Team\n    Sie arbeiten mit aktuellen Frameworks und Konzepten (REST APIs, Micro Services, Responsive Webdesign, Git, npm)\n    Sie stehen im engen Austausch mit unseren UX-Designern und Product-Ownern und stimmen\n    fachliche und technische Komponenten der Architektur ab\n    Sie haben aktuelle Trends stets im Blick und setzen diese in Webtechnologien und Softwaredesigns um\n\nIhr Profil\n\n    Sie verfügen über ein Studium oder eine abgeschlossene Berufsausbildung im IT-Bereich\n    Bestenfalls besitzen Sie bereits Kenntnisse in JavaScript, Typescript, Node.js, HTML oder Sass\n    Erste Erfahrungen in der Entwicklung von Frontendsystemen (React, Piral, Material UI) sowie\n    mit Continuous Integration (GitLab CI) im Umfeld von Progressive Web Apps sind von Vorteil\n    Sie verfügen über sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\n    Sie sind mit Herz bei der Arbeit, sind aufgeschlossen, teamfähig und arbeiten ziel- und ergebnisorientiert\n\n",
		"skillList": "react, piral, typescript, pwa, sass, mui, rest, microservices, responsive, git, node, cicd",
		"publicationDate": "2022-12-22"
	},
	{
		"id": 25,
		"title": "Webentwickler",
		"company": "WRS Energie + Druckluft GmbH",
		"url": "https://www.linkedin.com/jobs/view/3407485504/?alternateChannel=search&refId=UEPWpoXqAcAJh%2BqtdHwMmQ%3D%3D&trackingId=CyV1rkRmqCxXbaAEZWA5JQ%3D%3D",
		"description": "Was dich erwartet?\n\n\n    Du entwickelst überwiegend in Python\n    Du programmierst REST API Schnittstellen von und zu anderen Systemen\n    Du bist fachlicher Entscheider/in für softwaretechnische Themen\n    Du entwickelst unsere Plattformlösung weiter (Fokus Backend)\n    Du übernimmst Aufbau und Umsetzung einer skalierbaren, cloudbasierten Infrastruktur (Hetzner Cloud)\n    Du entwickelst und implementierst KI-basierte Anomalieerkennungen sowie integrierst du automatisierte Reportings\n    Du entwickelst und integrierst verschiedene MicroServices\n\n\nWas du mitbringen solltest?\n\n\n    Du hast ein abgeschlossenes Studium im Bereich Informatik oder abgeschlossene Ausbildung mit Informatikbezug\n    Du besitzt ein ausgeprägtes Interesse an modernen Technologien und künstlicher Intelligenz\n    Du verfügst über sehr gute Kenntnisse in Python sowie gute Kenntnisse mit Docker-Containerisierung und Datenbankmanagementsystemen (Influx DB, MongoDB)\n    Du hast gute Kenntnisse im Bereich REST-Schnittstellen & JSON\n    Du besitzt Erfahrung in Cloud Umgebungen wünschenswert (AWS, Azure oder Hetzner Cloud)\n    Du verfügst über sehr gute Deutschkenntnisse und idealerweise Kenntnisse in JavaScript, React oder Angular",
		"skillList": "react, angular, python, aws, azure, hetzner, rest, json, influxdb, mongodb, docker, ai",
		"publicationDate": "2022-12-23"
	},
	{
		"id": 26,
		"title": "React Entwickler",
		"company": "WeMatch",
		"url": "https://www.xing.com/jobs/berlin-react-entwickler-94517585?ijt=jb_21&paging_context=similar_postings",
		"description": "Aufgaben\n\n    Sie entwickeln Cyber Security-Lösungen und Webanwendungen im Frontend, um den Usern ein bestmögliches Erlebnis zu ermöglichen\n\n    Dabei werden folgende Technologien eingesetzt: Javascript, Typescript, React.js, React Hooks, React Functional Components\n\n    Usability, Darstellung und Performance halten Sie stets im Blick\n\n    Das Schreiben von Clean Code und das Durchführen von automatisierten Software Tests (Jest) gehört ebenfalls zu Ihrem Daily Business\n\nProfil\n\n    Abgeschlossenes Studium der (Wirtschafts-)Informatik oder vergleichbare Qualifikation sowie mindestens vier Jahre Berufserfahrung\n\n    Sehr gute Kenntnisse bei der Anwendung von gängigen Web-Technologien wie HTML5, CSS/SCSS, JavaScript und TypeScript\n\n    Sehr guter Kenntnisse in der Entwicklung von Single-Page-Webapplikationen mit React\n\n    Erfahrungen mit anderen JavaScript-Frameworks von Vorteil (z.B. Angular, Vue, Polymer, Stencil)\n\n    Erfahrung mit gängigen Werkzeugen der Webentwicklung (z.B. Jest, Cypress, Storybook, Nx, Vite)\n",
		"skillList": "react, typescript, reacthooks, jest, sass, angular, vue, polymer, stencil, cypress, storybook, nx, vite",
		"publicationDate": "2022-12-24"
	},
	{
		"id": 27,
		"title": "Fullstack Developer",
		"company": "PACE Telematics GmbH",
		"url": "https://www.xing.com/jobs/karlsruhe-fullstack-developer-javascript-typescript-node-js-react-95148608?paging_context=search&search_query%5Bkeywords%5D=react%20typescript&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Aufgaben\n\n    Du bringst frische Ideen und Learnings in das Team ein und entwickelst mit deinen Kolleg:innen innovative, interaktive Anwendungen in einem modernen TypeScript Stack (React, node.js).\n    Du entwickelst Frontend-Applikationen die viele tausende Kunden am Tag nutzen. Auch kleinere Arbeiten an dem node.js Backend schrecken Dich nicht ab.\n    Gemeinsam mit dem Backend-Team arbeitest Du an der Definition von APIs.\n    Du bist sowohl in die technische Konzeption neuer Features als auch in die Gestaltung langfristiger Strategien eingebunden und kannst eigene Ideen einbringen.\n    Du führst A/B-Tests durch und wertest diese aus um zu analysieren, wie unsere Kunden das Frontend nutzen und somit potenzielle Verbesserungen zu finden.\n\nQualifikation\n\n    Du hast mehrjährige Erfahrungen mit den Programmiersprachen TypeScript / node.js.\n    Dein Fokus liegt auf sicheren, stabilen und performanten Javascript Anwendungen.\n    Moderne Web-Frameworks wie React.js, Vue.js oder Angular.js sind für Dich nichts Neues.\n    Versionskontrolle mit Git liegt Dir am Herzen.\n    Du überzeugst außerdem durch Teamfähigkeit, eigenständiges sowie zielgerichtetes Arbeiten und verfügst über gute Kommunikationsfähigkeiten.\n    Sehr gute Deutsch- sowie gute Englischkenntnisse und eine gute Portion Humor runden Dein Profil ab.\n",
		"skillList": "react, typescript, node, rest, abtests, vue, angular, git",
		"publicationDate": "2022-12-25"
	},
	{
		"id": 28,
		"title": "TypeScript Entwickler",
		"company": "Projektron GmbH",
		"url": "https://www.xing.com/jobs/berlin-typescript-entwickler-94974036?paging_context=search&search_query%5Bkeywords%5D=typescript&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Aufgaben\n\nAls Entwickler in einem unserer drei exzellenten Teams arbeiten Sie nach Scrum an der Weiterentwicklung von Projektron BCS.\n\nDabei erarbeiten Sie Umsetzungskonzepte für Erweiterungen und Änderungen in BCS und setzen diese anschließend in einem von aktuell drei Scrum-Teams um.\n\nAuch uns passieren einmal Fehler, die wir im Team beheben und durch eine hohe Testabdeckung zukünftig verhindern können.\n\nDas Feedback unserer Anwender ist uns sehr wichtig, weshalb Sie unseren Second-Level Support regelmäßig bei der Lösungssuche von kundenspezifischen Wünschen sowie bei der Konfiguration von BCS oder der Anbindung externer Systeme unterstützen.\n\nWir möchten insbesondere Frauen dazu ermutigen, sich bei uns zu bewerben.\nQualifikation\n\n✔ Sehr gut abgeschlossenes Informatik-Studium oder ein gleichwertiges Studium aus dem MINT-Bereich\n\n✔ Hervorragende Programmierkenntnisse in TypeScript\n\n✔ 2 Jahre Berufserfahrung in einem ähnlichen Aufgabenumfeld\n\n✔ Kenntnisse in mindestens zwei der folgenden Bereiche:\n\n    Webtechnologien (HTML5, CSS, JavaScript, etc.)\n    Progressive Web Apps (PWA)\n    Java\n    Automatisiertes Testen\n    Web Services (REST)\n    Buildtools wie Jenkins, Gradle, Webpack\n    Frameworks wie React, d3.js\n    Domain Driven Design\n\n✔ Gute Deutschkenntnisse (B1 oder höher)",
		"skillList": "typescript, pwa, java, rest, jenkins, gradle, webpack, react, d3, mint, domaindrivendesign, testing, scrum, projektronbcs",
		"publicationDate": "2022-12-26"
	},
	{
		"id": 29,
		"title": "Developer PHP/TypeScript/React",
		"company": "CrewBrain",
		"url": "https://www.stepstone.de/stellenangebote--Software-Developer-PHP-JavaScript-TypeScript-React-m-w-d-in-Voll-oder-Teilzeit-Baden-Baden-CrewBrain-GmbH--9008747-inline.html?rltr=1_1_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Aufgaben:\n\n    Du bist verantwortliche für die Wartung und Weiterentwicklung unserer Softwarelösung \"CrewBrain\"\n    Du entwickelst unsere Software im Backend mit PHP, MySQL und JavaScript und / oder im Frontend mit Java- / TypeScript, Svelte und React Native\n    Als Mitglied eines agilen Teams bist du nicht nur an der Entwicklung, sondern auch an der Konzeption beteiligt\n\nDein Profil:\n\n    Du hast ein abgeschlossenes Studium der (Wirtschafts-)Informatik oder vergleichbare Ausbildung\n    Du hast sehr gute Kenntnisse in PHP, JavaScript, und MySQL und / oder in ReactNative und JavaScript / TypeScript\n    Du verfügst über Lösungs- und Kundenorientiertes Denken und bist in der Lage, einfache und verständliche Benutzeroberflächen zu konzipieren und umzusetzen\n    Optional verfügst du über Kenntnisse in GIT, nodeJS, Docker, Kubernetes, Amazon Web Services oder Microsoft Azure\n    Du hast Lust und Interesse daran, in einem Startup richtig etwas zu bewegen\n",
		"skillList": "php, mysql, typescript, svelte, reactnative, git, node, docker, kubernetes, aws, azure",
		"publicationDate": "2022-12-27"
	},
	{
		"id": 30,
		"title": "Anwendungsentwickler",
		"company": "Statistisches Landesamt Baden-Württemberg",
		"url": "https://www.stepstone.de/stellenangebote--Anwendungsentwickler-w-m-d-Stuttgart-Statistisches-Landesamt-Baden-Wuerttemberg--8983435-inline.html?rltr=20_20_25_seorl_m_0_0_0_0_0_0",
		"description": "Die Amtliche Statistik ist mit ihrer soliden rechtlichen Basis, ihren Qualitätsstandards und ihren auf wissenschaftlichen Methoden beruhenden Werkzeugen eine fundierte Basis für Entscheidungen in vielen Lebensbereichen. Neue Methoden in der Informationstechnologie führen dazu, dass sich die amtliche Statistik in einer Veränderung und Weiterentwicklung befindet.\n\nAutomatisierung informationstechnischer Betriebsabläufe, ein hoher Standard der Informations­sicherheit und der Umgang mit großen Datenmengen z. B. mittels Methoden des Machine Learnings sind hier besonders zu nennen.\n\nDiesen Entwicklungen trägt das Statistische Landesamt mit einer im Aufbau befindlichen neuen IT-Abteilung Rechnung. Wir suchen Kolleginnen und Kollegen, die diese Veränderung und Weiterentwicklung mit neuen Methoden der Informationstechnologie von Anfang an mitgestalten möchten.\n\nZu dem Aufgabenspektrum des Referates „Anwendungsentwicklung “ gehören insbesondere\n\n    Verfahrensentwicklung für die Fachabteilungen des Hauses und anderen statistische Ämter (erfolgt in erster Linie mit Java und JavaScript unter Windows),\n    Entwicklung von Formularen für die Datenerhebung,\n    Tabellierung und grafische Aufbereitung,\n    Qualitätssicherung.\n\nAufgabenschwerpunkte\n\nZu den zu erledigenden Aufgaben gehören:\n\n    Entwicklung und Pflege von Fachverfahren mit Java, Frameworks und React,\n    Datenbankmodellierung und -entwicklung insbesondere mit MySQL,\n    Bugfixing und Troubleshooting der entwickelten Anwendungen,\n    Dokumentation der Software.",
		"skillList": "java, react, mysql, tomcat, jboss, testing",
		"publicationDate": "2022-12-28"
	},
	{
		"id": 31,
		"title": "Web Developer React/SQL",
		"company": "IMA Schelling Deutschland GmbH",
		"url": "https://www.xing.com/jobs/luebbecke-web-developer-maschinensoftware-react-sql-applikationen-95310684?paging_context=search&search_query%5Bkeywords%5D=sql%20react&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Was erwartet Dich?\n\n    Du entwickelst neue und bereits bestehende Webapplikationen und Mobile Apps für unsere Maschinen und deren Umfeld weiter\n    Du setzt innovative Features und eigene Ideen in direkter Zusammenarbeit mit den UI-/UX-Experten um\n    Du begleitest den gesamten Entwicklungsprozess von der Anforderungsanalyse über die Konzepterstellung bis zur Realisierung\n\nWas sollten Sie mitbringen?\n\n    Du verfügst über ein abgeschlossenes Studium der Informatik (FH/Uni) oder mehrjährige Berufserfahrung in der Web-Entwicklung\n    Du bringst fundierte Kenntnisse in diversen Web-Technologien (React, Node.js, TypeScript) mit\n    Du hast idealerweise Erfahrung in der Konzeption und Entwicklung von APIs (OpenAPI, REST)\n    Du besitzt Kenntnisse mit Kommunikationsprotokollen wie MQTT und AMQP\n    Du hast bereits Erfahrungen im Umgang mit Datenbanksystemen (SQL/noSQL)\n    Du hast gute Englischkenntnisse in Wort und Schrift",
		"skillList": "react, node, typescript, rest, openapi, sql, nosql, mqtt, amqp, ux",
		"publicationDate": "2022-12-29"
	},
	{
		"id": 32,
		"title": "Fullstack Entwickler NodeJS/React",
		"company": "Austin Fraser",
		"url": "https://www.xing.com/jobs/berlin-fullstack-entwickler-nodejs-react-deu-95176136?paging_context=search&search_query%5Bkeywords%5D=sql%20react&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Aufgaben\n\n    Du wirst Teil eines agilen Scrum Teams indem du neue Anwendungen konzipierst und eine Komponenten-Bibliothek aufbaust und erweiterst\n\n    Du evaluierst und erprobst neue Technologien und Frameworks\n\n    Mit deinem Entwicklungsteam die zentralen Internetauftritte für rund 50 Millionen Kund:innen weiterentwickeln\n\nProfil\n\n    Du bist ideenreich, lernst gerne neues dazu, hast Spaß an agiler Entwicklung, Code Reviews und eine Clean Code Mentalität\n\n    vertraut mit Technologien wie Java, JavaScript, HTML und CSS und gängigen Frameworks - Spring Boot, Maven/Gradle, ReactJS\n\n    Du sprichst Deutsch Verhandlungssicher in Wort und Schrift\n\n    Umgang mit SQL Datenbanken wie MySQL oder MariaDB Einsetzung von Software-Entwurfsmustern\n\n    Interesse an CI/CD (GitLabCI), Kubernetes und Docker\n\n    Mindestens 3 Jahre Berufserfahrung",
		"skillList": "react, node, java, springboot, maven, gradle, mysql, mariadb, cicd, gitlabci, kubernetes, docker, cleancode",
		"publicationDate": "2022-12-30"
	},
	{
		"id": 33,
		"title": "Fullstack Engineer Python/React",
		"company": "Amboss",
		"url": "https://www.xing.com/jobs/berlin-full-stack-engineer-python-react-memorization-team-94896682?paging_context=search&search_query%5Bkeywords%5D=sql%20react&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "What you will do\n\n    Design, build and extend our Python backend services and REST APIs.\n    Build new features for the AMBOSS Anki add-on, on the frontend, for desktop and mobile web clients.\n    Migrate existing features from Python, SSR and JavaScript to React and TypeScript, using our design system.\n    Maintain and extend our test suites and integration pipelines.\n    Use observability tools and practices to ensure quality in production.\n\nWhat you will bring\n\n    2+ years of experience in backend development using Python. We also work in Go, but it can be learned, if needed. On Python, we use FastAPI.\n    2+ years of experience in modern frontend development. We work mostly in TypeScript and React.\n    Some experience with Docker and Kubernetes or similar cloud orchestration systems. We use EKS on AWS.\n    Ideally experience in Python/Qt desktop development, or even Anki add-on experience, but it is not required.\n    Ideally experience with product analytics and SQL databases, in order to help make data-driven decisions in the team.\n    You hold yourself and others to a high bar, care deeply about the quality of your work, employ good quality engineering practices, and strive for constant improvement.\n    You thrive in a collaborative environment and like working with a diverse group of people, from medical stakeholders to platform engineers.\n    You enjoy shipping and maintaining great products within an empowered team, using modern integration, deployment and observability tools and practices.\n",
		"skillList": "react, typescript, python, sql, fastapi, go, docker, kubernetes, eks, aws, pythonqt",
		"publicationDate": "2022-12-31"
	},
	{
		"id": 34,
		"title": "Fullstack Developer React/Java",
		"company": "VEDA GmbH",
		"url": "https://www.xing.com/jobs/alsdorf-fullstack-developer-react-java-95109999?paging_context=search&search_query%5Bkeywords%5D=sql%20react&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "\nDein Profil:\n\n    Dein ProfilDu hast bereits Berufserfahrungen im Bereich der Fullstack-Entwicklung gesammelt.\n    Du besitzt einen ausgeprägten Teamgeist und entwickelst leidenschaftlich an Softwarelösungen.\n    Du beherrscht die Entwicklung in Java 8 (oder höher) sicher, Spring Framework (SpringBoot), Hibernate, SQL, Maven, React und TypeScript.\n    Du hast idealerweise Erfahrungen mit MaterialUI oder einer anderen Komponentenbibliothek gesammelt.,\n    Du verfügst über sehr gute Deutsch- und gute Englischkenntnisse.\n    Du hast Freude daran, andere Teammitglieder zu befähigen und dein Wissen weiterzugeben. \n\nDich erwartet:\n\n    Ein Produktteam, das Ende-zu-Ende-Verantwortung für in sich geschlossene Fachbereiche des Produkts übernimmt und Frontend sowie Backend in Zusammenarbeit mit UX Design und Product Owner gestaltet.\n    Eine effektive Mischung aus selbstwirksamem Arbeiten und Kooperation im Team.\n    Viel Freiraum und Flexibilität (z.B. bzgl. Zeit und Ort).\n    Eine stetige Weiterbildung und -entwicklung von Fähigkeiten – auch durch interdisziplinäre Aufgaben und Projekte.\n    Der Einsatz moderner Technologien und neuer Tools.\n    Führung auf Augenhöhe und eine innovationsfreundliche Fehlerkultur.\n    Austausch mit und Impulse von anderen Spezialist*innen.\n    Ein familiäres Unternehmensumfeld mit individuellen Entwicklungs- und Veränderungsmöglichkeiten.\n\n",
		"skillList": "react, java, typescript, springboot, hibernate, sql, maven, mui",
		"publicationDate": "2023-01-01"
	},
	{
		"id": 35,
		"title": "Software-Entwickler",
		"company": "CIPHRON GmbH",
		"url": "https://www.xing.com/jobs/hannover-software-entwickler-vollzeit-95370904?paging_context=search&search_query%5Bkeywords%5D=sqlite&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Aufgaben\n\nWir suchen zum frühestmöglichen Zeitpunkt einen Software-Entwickler (m/w/d) in Vollzeit\n\n    Begleitung von Sprints der Enwicklungsteams unserer Kunden mit besonderem Augenmerk auf Sicherheitsrelevante\n    Prozesse (SDLC)\n    Konzeptionierung und Umsetzung von Greenfield-Projekten mit einer agilen Methodik\n    Regelmäßige Betreuung und Wartung einer Bestandssoftware\n\nDie vollständige und detaillierte Benennung anfallender Aufgaben und zugeordneter Verantwortung vermitteln wir gerne in\neinem persönlichen Gespräch.\nQualifikation\n\n    Hohe Lernbereitschaft sowie eine analytische, strukturierte und selbstständige Arbeitsweise\n    Fundierte Kenntnisse im Bereich der sicheren Software-Entwicklung\n    Test-fokussierte Entwicklungsweise\n    Gute Kenntnisse in der Entwicklung mit Go\n    Grundkenntnisse mindestens eines modernen Javascript Frameworks (wünschenswert: VueJS) sowie HTML/CSS\n    Docker-Kenntnisse von Vorteil\n    Erfahrungen mit CI/CD wünschenswert\n    Keine Berührungsängste mit Linux-Servern und deren Konfiguration über Terminaleingaben\n    Sicherer Umgang mit Git, Gitlab\n    Sicherer Umgang mit SQL- und NoSQL-Datenbanken (z.B. MySQL, PostgreSQL, MongoDB, Sqlite)\n    Idealerweise Erfahrungen mit PHP, Zend Framework und LaTeX oder Bereitschaft sich in diese Themen einzuarbeiten\n    (Bestandssoftware)\n",
		"skillList": "go, react, angular, vue, docker, cicd, linuxadmin, git, gitlab, mysql, postgres, mongodb, sqlite, php, zend, latex",
		"publicationDate": "2023-01-02"
	},
	{
		"id": 36,
		"title": "Big Data Engineer",
		"company": "AP Sensing",
		"url": "https://www.stepstone.de/stellenangebote--Big-Data-Engineer-m-w-d-Boeblingen-bei-Stuttgart-AP-Sensing-GmbH--8864317-inline.html?rltr=55_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Verantwortung\n\n    Du arbeitest in einem interdisziplinären Team mit Experten an der Weiterentwicklung und Optimierung unserer Dateninfrastruktur\n    Du organisierst große Datenmengen in einem Data Lake\n    Du entwickelst auf Basis von Python effiziente Datenpipelines und Schnittstellen für das maschinelle Lernen und andere Anwendungen\n    Du ermöglichst Funktionsentwicklern die erfolgreiche und vielfältige Nutzung ihrer Arbeit und gestaltest so die Zukunft der verteilten faseroptischen Sensoren in einer Vielzahl neuer Anwendungen\n\nDein Profil\n\n    Du hast einen Studienabschluss in der Fachrichtung Informatik, Physik, Mathematik oder Ingenieurwissenschaften\n    Idealerweise verfügst du über erste praktische Berufserfahrung im Big Data Umfeld\n    Du kombinierst Programmierkenntnisse in Python mit Erfahrungen im strukturierten Umgang mit großen Datenmengen\n    Erste Erfahrung mit SQL und/oder NoSQL Datenbanken\n    Deine Arbeitsweise ist analytisch, strukturiert und selbständig\n    Du bringst gute Kommunikations- und Präsentationsfähigkeiten in Deutsch und Englisch mit",
		"skillList": "bigdata, datalake, datapipelines, sql, nosql, python, machinelearning, mint",
		"publicationDate": "2023-01-03"
	},
	{
		"id": 37,
		"title": "Full Stack Developer CMS",
		"company": "NOZ Digital GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-CMS-m-w-d-Osnabrueck-NOZ-Digital-GmbH--9071745-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "So bringst du dich ein:\n\n    Du arbeitest in einer modernen Entwicklungsumgebung mit einem agilen Team und modernen Technologien inkl. Codereview und Qualitätssicherung\n    Gemeinsam mit dem Team bist du verantwortlich für die Weiterentwicklung des Front- und Backends und den Betrieb unserer unternehmensweiten CMS-Lösung\n    Du arbeitest mit Entwicklern, Product Ownern und Projektmanagern hinsichtlich technischer und fachlicher Fragestellungen zusammen\n    Die Analyse, Bewertung und Optimierung von Anforderungen, Datenbanken und Prozessen gehören ebenfalls zu deinen Tätigkeiten\n    Mit deinem Fokus auf testgetriebene Entwicklungsmethoden gewährleistest du eine nachhaltig entwickelte Codequalität\n\nDas bringst du mit:\n\n    Abgeschlossenes Studium in einem MINT-Studiengang oder eine vergleichbare Ausbildung\n    Breiter Entwicklungs-Stack mit Fokus auf Java oder PHP sowie Javascript Frameworks (bspw. node.js, react…)\n    Gute Kenntnisse im Umgang mit MySQL oder MariaDB und Versionsverwaltungssystemen (z.B. Git)\n    Selbstverständlicher Umgang mit Continuous Integration / Development (CI/CD)\n    Idealerweise Erfahrung im Aufbau / Betrieb von verteilten Architekturen (Microservices), bevorzugt in der Public Cloud (z.B. AWS)\n    Spaß im Umgang mit Menschen, Teamfähigkeit, Kommunikationsstärke und eigenverantwortliches Arbeiten\n    Gute Deutsch- und Englischkenntnisse",
		"skillList": "java, php, node, react, mysql, mariadb, git, cicd, microservices, aws, mint",
		"publicationDate": "2023-01-04"
	},
	{
		"id": 38,
		"title": "Software Entwickler",
		"company": "Otto Group Solution Provider GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Software-Entwickler-m-w-div-Kotlin-Java-Kafka-SpringBoot-Typescript-React-Vue-js-AWS-Dresden-Otto-Group-Solution-Provider-OSP-GmbH--8848151-inline.html?rltr=1_1_25_seorl_m_0_0_0_0_0_0",
		"description": "Das erwartet dich\n\n    Ein offenes und cross-funktionales Team, dem Mehrwert, Code-Qualität, Design und die Schaffung agiler Software-Architektur wichtig ist\n    Kennenlernen von Handels-, Marketing- und Logistikprozessen der Otto Group\n    Gestaltung des gesamten Entwicklungsprozesses mit bspw. Typescript, React, Vue.js im Frontend und SpringBoot, Kotlin, Java, Kafka im Backend\n    Domain Driven Design, testgetriebene Entwicklung, Continuous Integraton und Continuous Delivery (z.B. Docker, Gradle und Jenkins, AWS, Kubernates)\n    Möglichkeiten kontinuierlich neue Technologien auszuprobieren und zu evaluieren\n\nDas bringst du mit\n\n    Du begeisterst dich für die Entwicklung und Entstehung von Konzepten sowie deren technische Umsetzung\n    Du bringst fundierte Kenntnisse und mehrjährige praktische Erfahrung in einer objektorientierten Programmiersprache (Java, Kotlin, Go etc.) und der Entwicklung mit Webtechnologien (TypeScript, Angular, React, Vue.js etc.)\n    Du besitzt idealerweise Know-how im Bereich Continuous Integration, Continuous Delivery und Testautomatisierung\n    Du bist ein Teamplayer, teilst gerne dein Wissen mit anderen und bist offen für neue Herausforderungen\n    Du hast Konversationssichere Deutsch- und Englischkenntnisse\n",
		"skillList": "react, typescript, vue, angular, springboot, kotlin, java, kafka, domaindrivendesign, testing, cicd, docker, gradle, jenkins, aws, kubernetes, go",
		"publicationDate": "2023-01-05"
	},
	{
		"id": 39,
		"title": "Backend Entwickler",
		"company": "Enerparc AG",
		"url": "https://www.stepstone.de/stellenangebote--Backend-Entwickler-m-w-d-im-Bereich-Erneuerbarer-Energien-Hamburg-Enerparc-AG--9034549-inline.html?rltr=12_12_25_seorl_m_0_0_0_0_0_0",
		"description": "Ihr Aufgabenbereich\n\nFür den Unterstützung unser IT-Abteilung suchen wir ab sofort einen motivierten und engagierten Backend Entwickler (m/w/d) für unseren Standort in Hamburg.\n\n    Unterstützung des Entwicklungsteams im Rahmen einer betriebsinternen Softwareentwicklung\n    Zusammenarbeit mit den Mitarbeitern des IT- und Energiehandels\n    Pflege von bestehenden Systemkomponenten\n\nIhr berufliches Know-how\n\n    Abgeschlossenes Studium der Informatik o.ä.\n    Erfahrung mit Javascript/Typescript / Node.js\n    Wünschenswert sind Erfahrungen mit MongoDB und relationalen Datenbanken sowie mit Amazon Web Services\n    Begrüßt werden Berufserfahrung in der Industrie\n    Schnelle Auffassungsgabe, hohe Eigeninitiative und Kreativität\n    Selbstständige Arbeitsweise, ausgeprägte Teamfähigkeit, Zuverlässigkeit, Belastbarkeit, Eigenmotivation\n\n",
		"skillList": "typescript, node, mongodb, aws",
		"publicationDate": "2023-01-06"
	},
	{
		"id": 40,
		"title": "Full Stack Developer",
		"company": "StayFriends GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-m-w-d-Berlin-StayFriends-GmbH--9076913-inline.html?rltr=15_15_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Aufgaben\n\n    Du konzipierst, implementierst und entwickelst eigenverantwortlich moderne Web-Applikationen in Frontend und Backend\n    Du entwickelst neue Features sowie Testing und Code Reviews\n    Du wartest und hältst unsere Plattform lebensfreunde.de instand\n    Du entwickelst mit Java und Angular\n    Du bist in einem14-tägigen Sprint-Zyklus mit ausführlichem Deployment, damit unsere User Deine Ergebnisse sehen und nutzen können\n\nDas ist unser Technologiestack\n\nJava Spring Boot\n\n    Angular 6+ / JavaScript\n    HTML5 / CSS3 / SASS\n    SQL / MySQL / NoSQL - MongoDB\n    JIRA\n    Bitbucket\n    Jenkins\n    Kubernetes / Fabric8 / Docker\n\nSo bist Du\n\n    Du hast ein erfolgreich abgeschlossenes Studium, eine abgeschlossene Ausbildung im Informatikbereich oder einschlägige Berufserfahrung\n    Du verfügst über fundierte Erfahrungen als JavaScript- / AngularJS Entwickler (m/w)\n    Du hast sehr gute HTML5 und CSS3 Kenntnisse für mehrere Browser\n    Du besitzt gute Kenntnisse der objektorientierten Programmierung mit Java\n    Idealerweise hast Du bereits Erfahrungen in der Frontend-Entwicklung für mobile Endgeräte (Responsive Design)\n    Idealerweise hast Du ebenfalls bereits Kenntnisse im Umgang mit Web Services (REST, Microservice Architectur, CQRS)\n    Du bist offen für agile Arbeitsmethoden",
		"skillList": "angular, java, sql, mysql, nosql, mongodb, springboot, rest, oop, responsive, sass, jira, bitbucket, jenkins, kubernetes, fabric8, docker,  microservices, cqrs",
		"publicationDate": "2023-01-07"
	},
	{
		"id": 41,
		"title": "Fullstack Entwickler",
		"company": "Conwiss Consulting GmbH",
		"url": "https://www.xing.com/jobs/berlin-fullstack-entwickler-java-it-support-informatik-95642617?paging_context=search&search_query%5Bkeywords%5D=mongodb&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Was erwartet dich?\n\n    Du entwickelst im Web-Frontend und JVM Backend\n    Du arbeitest mit den Methoden der agilen Softwareentwicklung wie Test-Driven Development (TDD), Pair-Programming oder Continuous Delivery\n    Du berätst bei der Entwicklung und Umsetzung von komplexen Applikationen\n    Du verantwortest Softwareentwicklung unter Nutzung aktueller Java-, Mobile- und Web-Technologien ​in einer AWS Cloud\n    Du verantwortest den regelmäßigen Dev Austausch, Entwickler Convention, Planning, Estimation usw.\n    Du arbeitest mit einem crossfunktionalen Scrum-Team sowie direkt mit den Kollegen aus UX, QA, Analytics etc. zusammen\n\nWas solltest du mitbringen?\n\n    Du hast ein abgeschlossenes Studium oder erfolgreich absolvierte Ausbildung mit Schwerpunkt Informatik\n    Du bringst Projekterfahrung in der agilen Softwareentwicklung (Scrum) und dem Aufbau komplexerer Webanwendungen mit\n    Du hast Erfahrung im Entwurf und der Erstellung von Web-Systemen mit Java-Technologien und gängigen WebTechnologien (JavaScript, HTML)\n    Du hast fundierte Erfahrungen in der Java Softwareentwicklung und Kenntnisse mit Cloud-Umgebungen (idealerweise AWS)\n    Du bringst Erfahrungen rund um dokumentenorientierte Datenbanken (z.B. MongoDB, DynamoDB) mit\n    Du hast Kenntnisse im Responsive Design, Kotlin, TypeScript, Docker, AWS, GitHub Actions, funktionale Programmierung\n    Du bringst projektbezogene Reisebereitschaft innerhalb Deutschlands mit\n    Du verfügst über gute Deutschkenntnisse\n",
		"skillList": "java, typescript, aws, mongodb, dynamodb, tdd, kotlin, docker, githubactions, functionalprogramming, cicd, ux",
		"publicationDate": "2023-01-08"
	},
	{
		"id": 42,
		"title": "Webentwickler",
		"company": "xSuite Group GmbH",
		"url": "https://www.xing.com/jobs/muenchen-webentwickler-it-customer-support-javascript-html-95647827?paging_context=search&search_query%5Bkeywords%5D=mongodb&search_query%5Blimit%5D=20&search_query%5Boffset%5D=0&ijt=jb_18",
		"description": "Was erwartet dich?\n\n    Du verantwortest die (Weiter-)Entwicklung unseres breiten Produkt-Portfolios und konzipierst und realisierst hierfür neue Features im Rahmen eines Scrum-orientierten Entwicklungsprozesses (inkl. Sprints, Reviews, Retrospective, Continuous Deployment, Continuous Integration)\n    Du arbeitest mit dem \"Core\"-Entwicklerteam zusammen und darüber hinaus stehst du im engen Austausch mit dem Produktmanagement\n    Du führst zur Qualitätssicherung Funktions-, Integrations- sowie Modultests durch und bist für die Erstellung von Dokumentationen verantwortlich\n\nWas solltest du mitbringen?\n\n    Du verfügst über mehrjährige Erfahrung als JavaScript Entwickler (m/w/d)\n    Du besitzt hervorragende Kenntnisse in HTML und CSS und kennst dich mit REST, MVC oder Single-Page Applications aus\n    Du gehst sicher mit Frameworks wie Angular.js, React, Vue.js, jQuery oder OpenUI5 um\n    Du besitzt bestenfalls Open Source Kenntnisse (z.B. MongoDB, PostgreSQL, Kubernetes und Docker) oder Kenntnisse in Node.js\n",
		"skillList": "react, node, rest, mongodb, postgres, angular, vue, mvc, jquery, openui5, docker, kubernetes, cicd",
		"publicationDate": "2023-01-09"
	},
	{
		"id": 43,
		"title": "Softwareentwickler Go / Golang",
		"company": "ESE Engineering und Software-Entwicklung GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Softwareentwickler-Go-Golang-m-w-d-Braunschweig-und-Hannover-ESE-Engineering-und-Software-Entwicklung-GmbH--6029808-inline.html?rltr=3_3_25_seorl_m_0_0_0_0_1_0",
		"description": "Was Du bei uns machst\n\nStarte bei uns als Go-Entwickler und wirke bei der Digitalisierung von Vertriebsplattformen von der Entscheidungsfindung über die Planung bis hin zu Programmierung und Test mit.\n\n    Programmierung und Test von Backend Systemen\n    Eigenverantwortliche Umsetzung funktionaler Anforderungen\n    Selbstständige Weiterentwicklung und Optimierung bestehender Systeme\n    Aufbau und Anbindung neuer Systeme an die bestehende IT-Landschaft\n    Analyse und Behebung von Software-Fehlern\n    Unterstützung bei der Entscheidungsfindung und Entwicklungsprozessplanung\n\nWann Du zu uns passt\n\n    Abgeschlossenes Informatikstudium oder eine vergleichbare abgeschlossene Ausbildung\n    Erste Berufserfahrung in der Entwicklung mit Go / Golang sowie in der Schnittstellenprogrammierung\n    Erfahren in der Arbeit mit gängigen Datenbanken (z.B. MongoDB, CouchDB) und MySQL\n    Kenntnisse in der Programmiersprache C#/.Net wünschenswert\n    Erste Erfahrungen in der Frontend Entwicklung und Frameworks wie z.B. Spring, Angular, React von Vorteil\n    Hohe Team- und Kommunikationsfähigkeit sowie Freude am agilen Arbeiten\n    Deutsch fließend und Englisch sehr gut in Wort und Schrift\n\n",
		"skillList": "go, mongodb, couchdb, mysql, react, angular, csharp, dotnet, springboot, testing",
		"publicationDate": "2023-01-10"
	}
]