[
	{
		"id": 1,
		"title": "Frontend Developer",
		"company": "PwC Deutschland",
		"url": "https://www.get-in-it.de/jobsuche/p172318?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Frontend-Entwicklung - Unser Produkt ist zentraler Bestandteil der Digitalisierungsstrategie von PwC Deutschland. Unsere Lösungen sollen komplexe Probleme einfach machen, dafür brauchen wir intuitive und moderne Frontends - und die baust du! Du bist zentrale:r Ansprechpartner:in für die Frontend Entwicklung eines wichtigen internationalen Prüfungstools in einem agilen Team der Digital Factory. Du konzipierst Responsive Web-Apps mit JavaScript /TypeScript und Angular und entwickelst diese weiter. Du kannst schnell UI-Prototypen aufsetzen, aber auch robuste, skalierbare Frontends im Angular Framework für unser Tool implementieren.\n\nFachliche Expertise - Du hast bereits Erfahrung in der Entwicklung von Web Applikationen mit HTML, CSS und JavaScript/TypeScript. Moderne UI Frameworks (Angular) hast du bereits erfolgreich eingesetzt, idealerweise hast du auch schon Erfahrung mit WebSocket.\n\nAgile Mindset - Du lebst und liebst Frontend-Technologien und entwickelst so kontinuierlich Produkt, Prozesse und Zusammenarbeit weiter.\n\nTeamwork - Unsere Teams sind cross-funktional. Du arbeitest Hand in Hand mit anderen Entwickler:innen, Automation Engineers und UX Kolleg:innen an der gemeinsamen Produktvision.\n\nArbeite wie es zu deinem Leben passt: mit FlexWork. Keine fixen Home-Office-Tage, sondern deine Chance Arbeitszeit und -ort variabel zu gestalten.\nDein Profil\n\nDu verfügst über ein abgeschlossenes Studium im Bereich Informatik oder eine vergleichbare Ausbildung und bringst Berufserfahrung im IT Umfeld, insbesondere im Frontend-Bereich, mit.\n\nDu hast ein grundlegendes Verständnis von Build-Prozessen, CI/ CD, Testing. Die Testautomatisierung im Frontend-Bereich ist für dich kein Neuland.\n\nDu hast idealerweise auch Erfahrungen im User Tracking mit Hotjar oder Piwik.\n\nDu suchst ein agiles Umfeld, in dem du deine Stärken ausspielen kannst.\n\nSehr gute Deutsch- und Englischkenntnisse helfen dir dabei, deine Ideen auch im internationalen Kontext oder mit internationalen Teamkolleg:innen zu teilen.",
		"skillList": "angular, cicd, testing, hotjar, piwik",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 2,
		"title": "Frontend-Entwickler",
		"company": "networker, solutions",
		"url": "https://www.get-in-it.de/jobsuche/p197373?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Deine Aufgaben bei uns\n\n    Entwicklung von Frontend und UI-Komponenten\n    Betreuung und Weiterentwicklung bestehender Systeme\n    Zusammenarbeit mit anderen Dienstleistern an gemeinsamen Kundenprojekten\n    Umsetzung eigener Webentwicklung gemeinsam mit den Teams\n\nDeine Kompetenzen\n\n    JavaScript, Type Script\n    HTML + CSS\n    React\n    Jest Testing\n    RESTful APIs + Swagger\n    Git, Gitlab\n    Webstorm\n    NestJs\n    UX-Design",
		"skillList": "typescript, react, jest, rest, swagger, git, gitlab, webstorm, nestjs, ux",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 3,
		"title": "Web Frontend Entwickler",
		"company": "EPI development",
		"url": "https://www.get-in-it.de/jobsuche/p132078?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Die Herausforderung\n\n    Erstellung einer Bedarfsanalyse für neue Funktionen mit einer selbsterklärenden UI Gestaltung\n    Entwickeln von Funktionen und Algorithmen die nachhaltig lesbar sind\n    Der Fokus liegt in der Vereinfachung komplexer Vorgänge\n\nDeine Aufgaben\n\n    Weiterentwicklung von epirent aufgrund von aktuellen Anforderungen\n    Im Team Lösungen für neue Funktionen erarbeiten\n    Erstellen von gut bedienbaren und ausgeklügelten UI, denke wie ein Anwender\n    Kommunikation im Team, einbringen eigener Ideen\n    Offener Umgang mit neuen Technologien\n    Kreativität ist gefragt\n\nDeine Fähigkeiten\n\n    Weitreichende Erfahrungen in der Anwendungsprogrammierung\n    Klare und selbsterklärende UI Designs erstellen\n    Komplizierte technische Zusammenhänge auf einfache Funktionen herunterbrechen\n    Kommunikativ im Team, zielorientiert und selbständig in der Arbeitsorganisation\n    Deine Sprachkenntnisse (optimal): JavaScript, CSS, HTML, Bootstrap, AngularJS, API Entwicklung (REST), Responsive Design / Progressive Apps\n    Kein Hochschulabschluss notwendig, Können zählt!",
		"skillList": "angular, bootstrap, rest, responsive, pwa",
		"publicationDate": "2022-11-17"
	},
	{
		"id": 4,
		"title": "Frontend Developer",
		"company": "reuter onlineshop",
		"url": "https://www.get-in-it.de/jobsuche/p206536?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Successfully completed studies with a focus on computer science, a similar education or relevant professional experience\nVery good knowledge in React or similar\nGood knowledge of HTML, CSS, JavaScript and Jest/Mocha\nTypeScript, Gitlab, Next.js, styled-components, Storybook and Webpack sound familiar to you\nInspire with your innovative thinking and don't lose sight of the big picture\nGet actively involved in professional discussions",
		"skillList": "react, jest, mocha, typescript, gitlab, nextjs, styledcomponents, storybook, webpack",
		"publicationDate": "2022-12-06"
	},
	{
		"id": 5,
		"title": "Frontend Developer und Consultant",
		"company": "codecentric",
		"url": "https://www.get-in-it.de/jobsuche/p206964?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Du hast ein tiefes, technisches Verständnis von Webtechnologien, wie JavaScript, TypeScript, HTML5 und CSS3 sowie Angular, ReactJS und/oder VueJS\n    Du kennst dich mit CSS-Präprozessoren und CSS-Architekturen aus\n    Du bist vertraut mit der Cross-Browser-Problematik\n    Du bist sicher im Umgang mit modernen Buildtools (z. B. Fuse-Box, Rollup, Webpack) und hast Kenntnisse aktueller Testing Frameworks (z. B. Mocha, Jasmine oder Jest)\n    Du kennst die agilen Werte und arbeitest gerne in agilen Teams\n    User Experience und Responsive Design interessieren dich\n    Beratung liegt dir und du kannst dir vorstellen, unsere Kunden technologisch oder/und methodisch zu schulen. Dafür bringst du eine hohe Kommunikationsfähigkeit und verhandlungssichere Deutschkenntnisse mit",
		"skillList": "typescript, angular, react, vue, fusebox, rollup,webpack, mocha, jasmine, jest, ux, responsive",
		"publicationDate": "2022-12-07"
	},
	{
		"id": 6,
		"title": "Praktikant IT-Beratung Public Sector",
		"company": "PwC",
		"url": "https://www.stepstone.de/stellenangebote--Praktikant-Werkstudent-IT-Beratung-Public-Sector-w-m-d-Berlin-Duesseldorf-Frankfurt-a-M-Muenchen-Saarbruecken-Stuttgart-PwC--7857961-inline.html?rltr=7_7_25_seorl_m_0_0_0_0_0_0",
		"description": "Durch relevante Studienschwerpunkte oder praktische Erfahrungen hast du Grundkenntnisse in einem der folgenden Themen:\n\n- klassische Softwareentwicklung (z. B. C/C++, Java, C#),\n\n- Webentwicklung (z.B. JavaScript, Angular, React),\n\n- (Web-) Designpattern (MVC, MVVC),\n\n- Datenhaltung (z.B. SQL, noSQL, XML, JSON),\n\n- Cloud (Azure, Google, AWS, SAP),\n\n- Konzeption von IT-Architekturen/ IT-Infrastrukturen.",
		"skillList": "c, cplusplus, java, csharp, angular, react, mvc, mvvm, azure, aws, gcp, nosql, sql, xml, json, sap",
		"publicationDate": "2022-12-08"
	},
	{
		"id": 7,
		"title": "Frontend Entwickler React (Typescript)",
		"company": "ibi systems GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Frontend-Entwickler-React-Typescript-m-w-d-Regensburg-ibi-systems-GmbH--8924608-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_1_0",
		"description": "Deine Aufgaben\n\n    Technische Konzeption, Design und Implementierung neuer Features\n    Anpassung und kontinuierliche Optimierung bestehender Features\n    Agile Entwicklung mit Scrum und gitflow (inkl. Pull Requests)\n    Keine Scheu vor Frontend-nahen Entwicklungstätigkeiten im Backend\n    Idealerweise Umsetzung unserer UX-Designs\n\nUnser Stack\n\n    Architektur: Domain Driven Design, Microservices, Event-driven\n    Backend: .NET 6 (C#), Entity Framework Core, Hangfire, RabbitMQ\n    Frontend: React, Material UI (MUI), GraphQL (Apollo), Typescript sowie ASP.NET Web API (REST API)\n    Hosting: Docker, Kubernetes, Azure, OpenShift\n    Unit Tests mit NUnit\n    Moderne Entwicklungstools wie JetBrains Rider/WebStorm, Git und DevOps Server\n",
		"skillList": "agile, scrum, gitflow, ux, domaindrivendesign, microservices, dotnet, entityframework, hangfire, rabbitmq, react, mui, graphql, apollo, typescript, aspnet, rest, docker, kubernetes, azure, openshift, nunit, rider, webstorm, devopserver, vue, angular",
		"publicationDate": "2022-12-12"
	},
	{
		"id": 8,
		"title": "Fullstack developer React framework",
		"company": "ALTEN GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Fullstack-developer-m-f-d-React-framework-Munich-ALTEN-GmbH--8995148-inline.html?rltr=15_15_25_seorl_m_0_0_0_0_1_0",
		"description": "\n    Successfully completed studies in computer science, electrical engineering  or similar\n    Relevant years of work experience as a Full Stack Engineer and have built and operated an application in production in the past, preferably in the area of e-commerce\n    Developing applications with React, modern JavaScript standards (ES6/ES7), HTML5 and CSS\n    Practical experiences with NoSQL data bases like MongoDB\n    Comfortable with building, deploying and operating your application as micro services in a cloud infrastructure\n    Very good knowledge of English\n",
		"skillList": "react, mongodb, microservices, cloud",
		"publicationDate": "2022-12-13"
	},
	{
		"id": 9,
		"title": "Junior-Softwareentwickler:in",
		"company": "Qnips GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Junior-Softwareentwickler-in-Hannover-Qnips-GmbH--7783712-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Du bringst viel Interesse an modernen IT-Systemen, neuen Frameworks & Programmiersprachen mit \nDu bist fit in der Programmierung und fühlst dich in einem der nachfolgenden Bereiche wohl. Wir finden den passenden Tech-Stack für dich! \n\n    Android: Kotlin und Jetpack Compose \n     iOS: Swift und Swift UI \n     Backend Development: C#, .NET, Google Firebase, Cloud functions \n     Hybride App Development: Flutter mit Dart \n     Web Development: Angular, TypeScript-Framworks\n\nIdealerweise besitzt Du Kenntnisse im Umgang mit (RESTful-) Webservices sowie Git als Versionsverwaltung.  \nDu hast ein großes Herz für gute User Experience, durchdachtes Interface Design oder state-of-the-art API-Design ",
		"skillList": "kotlin, jetpackcompose, swift, csharp, dotnet, firebase, flutter, dart, angular, rest, git",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 10,
		"title": "Backend Developer - Typescript, Node.JS",
		"company": "Interhyp Gruppe",
		"url": "https://www.stepstone.de/stellenangebote--Backend-Developer-Typescript-Node-JS-m-w-d-Muenchen-Interhyp-Gruppe--9006012-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_0_0",
		"description": " wir dich unbedingt brauchen, da du unsere digitalen Produkte entwickelst – mit Technologien wie z. B. Typescript, Node.JS, Express, MongoDB, Rest.\n\n… unsere Product Owner voll und ganz auf dich als kompetente*n Ansprechpartner*in zählen.\n\n… wir nicht genug von deinem Feedback zu den User Storys kriegen können und du uns dabei hilfst, ein herausragendes Produkt für unsere Kund*innen zu schaffen.\n\n… du immer und immer wieder deine eigenen Ideen einbringst, um damit Qualität, technische Verbesserungen sowie neue Features voranzutreiben.\nUnd du passt perfekt zu uns, denn...\n\n… du hast mindestens zwei Jahre relevante Erfahrung in der Arbeit mit schnell skalierenden und komplexen Systemen.\n\n… über umfassende Erfahrung mit Typescript, Node.JS verfügst du bereits und besitzt idealerweise schon praktische Erfahrung mit Express, MongoDB, Rest.\n\n… als Teamplayer schlägt dein Herz dafür, Feedback zu erhalten und zu geben, um sowohl persönlich als auch als Software Engineer (m/w/d) zu wachsen.\n\n… du handelst lösungsorientiert, übernimmst aktiv Verantwortung und stellst dich gern neuen Herausforderungen.",
		"skillList": "typescript, node, express, mongodb, rest",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 11,
		"title": "Full Stack Developer",
		"company": "ASAMBEAUTY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-m-w-d-Unterfoehring-Muenchen-ASAMBEAUTY-GmbH--8963596-inline.html?rltr=3_3_25_seorl_m_0_0_0_0_1_0",
		"description": "    Abgeschlossene Ausbildung als IT-Systemelektroniker, Fachinformatiker oder eine vergleichbare Ausbildung\n    3-5 Jahre Erfahrung als Full Stack-Entwickler oder eine ähnliche Funktion\n    Erfahrung in der Arbeit mit Shopsystemen, hauptsächlich Magento 2\n    Erfahrung in der Entwicklung von Desktop- und mobilen Anwendungen\n    Kenntnisse mehrerer Front-End-Sprachen und Bibliotheken (z.B. HTML/CSS, JavaScript, XML, jQuery)\n    Kenntnisse in mehreren Back-End-Sprachen, hauptsächlich PHP und JavaScript-Frameworks (z.B. Angular, React, Node.js)\n    Vertrauter Umgang mit Datenbanken (z.B. MySQL), Web-Servern (z.B. Apache, NGINX) und UI/UX-Design\n    Vertrauter Umgang mit Cloud-Hosting (AWS)\n    Erste Erfahrungen in anderen Bereichen von eCommerce-Plattformen wie Zahlung, Produktdaten, Auftragsverwaltung, Webanalyse, Inhaltsverwaltung, Werbung, Suche usw.\n    Erste Erfahrungen mit dem Lebenszyklus in einer agilen / Scrum-Umgebung",
		"skillList": "magento, xml, jquery, php, angular, react, node, mysql, apache, nginx, ux, aws, scrum",
		"publicationDate": "2022-12-14"
	},
	{
		"id": 12,
		"title": "Machine Learning Engineer",
		"company": "HDP-Gesellschaft für ganzheitliche Datenverarbeitung mbH",
		"url": "https://www.stepstone.de/stellenangebote--Machine-Learning-Engineer-m-w-d-Alzey-HDP-Gesellschaft-fuer-ganzheitliche-Datenverarbeitung-mbH--8076473-inline.html?rltr=14_14_25_seorl_m_0_0_0_0_0_0",
		"description": "\n    Die Erfüllung der Aufgaben setzt ein abgeschlossenes Studium im MINT-Bereich voraus.\n    Des Weiteren werden Kenntnisse im Bereich Machine Learning sowie fortgeschrittene Programmierkenntnisse in einer objektorientierten Sprache (bevorzugt Python) vorausgesetzt.\n    Erfahrungen mit einschlägigen Frameworks und Werkzeugen zu Machine Learning und dem Python Scientific Stack sind wünschenswert (z.B. scikit-learn, TensorFlow, PyTorch).\n    Idealerweise verfügen Sie über Erfahrungen im Bereich Software Engineering und Testen.\n    Ein hohes Qualitätsbewusstsein, eine ausgeprägte Innvoations- und Lernbereitschaft sowie Eigeninitiative zeichnet Sie und Ihren Arbeitsstil aus.\n    Als zielorientierte Persönlichkeit gehen Sie analytisch vor und lösen Problemstellungen strukturiert.\n    Sie sind ein engagierter Teamplayer, bringen sich gerne ein und sind offen für Neues.\n",
		"skillList": "mint, machinelearning, python, oop, pythonsciencestack, scikitlearn, tensorflow, pytorch, testing",
		"publicationDate": "2022-12-15"
	},
	{
		"id": 13,
		"title": "Entwickler React / Cloud",
		"company": "itdesign GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Remote-Software-Developer-Entwickler-React-Cloud-m-w-d-Tuebingen-bei-Stuttgart-Zwickau-Mainz-itdesign-GmbH--8056768-inline.html?rltr=12_12_25_seorl_m_0_0_0_0_0_0",
		"description": "Das tun wir\n\n    Im Scrum Team konzipieren wir die Architektur und implementieren Features\n    Durch Code Review und Remote Pair Programming stellen wir die Code-Qualität sicher\n    Wir deployen die Microservices des Teams\n    Wir tauschen uns täglich über Herausforderungen und technische Trends über Collaborations Tools aus und lernen voneinander und miteinander\n\nDas bist du\n\n    In den Bereichen Softwarearchitektur, Web-Applikationen oder Server-Client-Systeme fühlst du dich wohl\n    Moderne JavaScript Frameworks, z.B. React, Vue, Angular oder Backend-Technologien wie Spring Boot sind deine Leidenschaft\n    Du brauchst beim Programmieren Ruhe und kannst dich zu Hause am besten konzentrieren\n    Du willst auch remote Teil eines unschlagbaren Teams sein\n\n",
		"skillList": "scrum, codereview, pairprogramming, microservices, react, vue, angular, springboot",
		"publicationDate": "2022-12-16"
	},
	{
		"id": 14,
		"title": "Full Stack Developer",
		"company": "klarsolar GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Developer-m-w-d-Heidelberg-klarsolar-GmbH--8864165-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Deine Aufgaben:\n\n    Als aktiver Teil des Entwicklungsteams arbeitest du eigenverantwortlich an Softwarelösungen\n    Technische Best Practices wie Serverless, CQRS, Microservices und Micro Frontends kennst du wie deine Westentasche und setzt mit ihnen agile Anforderungsbeschreibungen aus User Stories und Use Cases in geeignete Softwarekomponenten um\n    Deine Aufgaben erstrecken sich über den gesamten Stack einer Applikation (Angular, GrapQL, NestJS)\n    Zur automatisierten Auslieferung von Software-Artefakten, setzt du Test-Cases in Test-Code um, damit eine Ergebnissicherung der Anwendung für das Team gewährleistet ist\n\nDein Profil:\n\n    Du bringst Erfahrungen in Frontend und Backend-Entwicklung mit Javascript, HTML, Node.js, Angular, GraphQL, Tailwind mit\n    In Projektteams findest du dich schnell zurecht, da du gut organisiert bist und das interdisziplinäre Arbeiten schätzt\n    Du bist erfahren in min. einem CI/CD Werkzeug (bspw. Git Hub Actions)\n    Du hast Kenntnisse in einem IaaS-Anbieter (z.B. Azure, AWS, Google..)\n    Du hast Kenntnisse der gängigen Cloud-Anwendungsplattformen (z.B. Docker,Kubernetes)\n    Du hast ein agiles Mindset, bist kollegial und ergebnisorientiert\n",
		"skillList": "serverless, cqrs, microservices, microfrontends, angular, graphql, nestjs, node, tailwind, cicd, githubactions, azure, aws, gcp, docker, kubernetes, agile",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 15,
		"title": "Frontend Entwickler",
		"company": "Bertelsmann",
		"url": "https://www.get-in-it.de/jobsuche/p204395?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Wir suchen Dich, denn Du bist motiviert und engagiert und hast Lust gemeinsam mit uns unsere neue Lernplattform stetig weiterzuentwickeln und zu optimieren.\n\nZudem bringst Du Folgendes mit:\n\n    Ein abgeschlossenes IT-Studium (Informatik, Wirtschaftsinformatik), eine Ausbildung als Fachinformatiker (m/w/d) oder eine vergleichbare Qualifikation\n    Mindestens drei Jahre Berufserfahrung in der Umsetzung von Web-Anwendungen\n    Fundierte Kenntnisse in ReactJS, TailwindCSS oder ein anderes CSS-Framework\n    Erfahrung mit Jest, CI/CD, Docker oder Nginx sind ein Plus\n    Eine strukturierte, selbstständige und zielorientierte Arbeitsweise\n    Verhandlungssichere Deutsch- und Englischkenntnisse",
		"skillList": "react, tailwind, jest, cicd, docker, nginx",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 16,
		"title": "Frontend Developer",
		"company": "modis",
		"url": "https://www.get-in-it.de/jobsuche/p207871?start=0&limit=39&ref=Jobsuche",
		"description": "    Sie bringen ein abgeschlossenes Studium oder eine Ausbildung im Bereich der Webentwicklung mit\n    Kenntnisse in HTML, CSS, JavaScript und React zeichnen Sie aus\n    Sie verfügen über Erfahrungen mit der Anbindung von Micro-bzw. Backend-Services (unter anderem REST)\n    Auch in den Bereichen Node.js-Ökosystem und moderne Build-Prozesse kennen Sie sich aus\n    Zudem besitzen Sie Kenntnisse im Umgang mit TypeScript, Fluent UI, Docker und Java\n    Abgerundet wird Ihr Profil dadurch, dass Sie ein Teamplayer sind und sich mit Engagement im Team einbringen",
		"skillList": "react, rest, node, typescript, fluentui, docker, java",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 17,
		"title": "Backend Developer TypeScript",
		"company": "snapADDY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Backend-Developer-TypeScript-NestJS-PostgreSQL-m-w-d-97070-Wuerzburg-snapADDY-GmbH--8962220-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Your profile\n\n    Passion for software development in the area of APIs, Databases and Backend\n    Collaborating with other developers and departments is enjoyable for you\n    Experience with modern JavaScript and TypeScript or willingness to learn\n    Structured, analytical, and independent way of working\n    An open and friendly personality who enjoys working with colleagues as part of a team\n\nOur technologies:\n\n    Development in JavaScript and TypeScript\n    Backend: NodeJS, NestJS, TypeORM, PostgreSQL, Redis\n    Tools: GitHub with ZenHub, Slack, Github Actions, Ionic AppFlow\n    Hosting: Amazon Web Services (AWS), Lambda Functions, Kubernetes\n\nNice-to-have\n\n    Experience with Amazon Web Services (AWS)\n    Knowledge about APIs and Integrations of B2B applications like Salesforce or Microsoft Dynamics\n",
		"skillList": "rest, typescript, node, nestjs, typeorm, postgres, redis, zenhub, githubactions, ionicappflow, aws, awslambda, kubernetes, salesforce, microsoftdynamics",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 18,
		"title": "Full Stack Webentwickler",
		"company": "Alevino",
		"url": "https://www.stepstone.de/stellenangebote--Full-Stack-Webentwickler-m-w-d-bundesweit-Alevino--8954447-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_1_0",
		"description": "Du bist ein Vollblut-Techie (m/w/d) mit einiger Erfahrung im Bereich Webentwicklung. Ideal sind\n\n    Praktische Erfahrungen im Bereich der Frontend-Entwicklung mit modernen Webtechnologien (HTML, CSS, Javascript), SPA-Frameworks (insbesondere React.js) und Progressive Web Apps (PWAs).\n    Kenntnisse der Backend-Entwicklung in Javascript bzw. Typescript mit Node.js (z. B. mit Nest.js) und gängigen Datenbanken (insbesondere PostgreSQL und Mongo DB)\n    Vertrautheit mit einschlägigen Konzepten wie Microservice-Architekturen und REST-Schnittstellen\n    Sicherer Umgang in der Versionsverwaltung mit Git und Erfahrungen im Bereich CI/CD mit Github oder Gitlab\n    Kenntnisse von Containerisierung und dem Betrieb von Anwendungen im Cloud-Umfeld (z. B. AWS), gerne auch mit Serverless-Computing-Ansätzen.\n    Bereitschaft Betriebsverantwortung im Sinne des DevOps zu übernehmen – „You build it, you run it“",
		"skillList": "react, pwa, typescript, node, nestjs, postgres, mongodb, rest, cicd, github, gitlab, aws, serverless, devops",
		"publicationDate": "2022-12-17"
	},
	{
		"id": 19,
		"title": "Frontend Developer",
		"company": "toom Baumarkt GmbH",
		"url": "https://www.stepstone.de/stellenangebote--Frontend-Developer-Cross-Channel-E-Commerce-m-w-d-51149-Koeln-toom-Baumarkt-GmbH-Ein-Unternehmen-der-REWE-Group--9028936-inline.html?rltr=2_2_25_seorl_m_1_0_0_0_1_0",
		"description": "Technologien: \n\nJavaScript | TypeScript | HTML | CSS | React | REST/GraphQL | Kubernetes | Gitlab CI/CD\n\nDeine Aufgaben: \n\n    Dein Fokus liegt auf der Entwicklung und Implementierung moderner und nutzerzentrierter Webanwendungen\n    Für deine Entwicklung nutzt du unsere Pattern Library basierend auf Atomic Design \n    Unserer Softwarearchitektur gestaltest du aktiv mit \n    Für die Einhaltung von Architekturvorgaben, die Wartbarkeit und Wiederverwendbarkeit der Komponenten sowie die Qualitätssicherungsmaßnahmen übernimmst du die Verantwortung \n    Neue Produktanforderungen werden von Dir analysiert und in unsere Gesamtarchitektur integriert \n    Du blickst über den Tellerrand und bringst neue Ideen und Technologien aus dem Bereich Webentwicklung ein \n    Du beteiligst Dich regelmäßig und aktiv daran, die Zusammenarbeit in unserem agilen Arbeitsumfeld zu verbessern \n\nDein Profil\n\nDas bringst du mit:\n\n    Leidenschaft für nachhaltige Software-Entwicklung und Clean-Code \n    Mehrjährige Berufserfahrung in objektorientierter Entwicklung von Webanwendungen \n    Idealerweise ein Studium der (angewandten) Informatik bzw. Wirtschaftsinformatik oder ein anderer überzeugender Werdegang \n    Fundierte Kenntnisse in JavaScript und/oder TypeScript, HTML und CSS  \n    Praktische Erfahrung mit JavaScript Frameworks/ Microfrontend-Architekturen wie VueJS, React oder Angular \n    Kenntnisse im Umgang und Aufsetzen automatisierter Tests (z.B. Cypress) \n    Expertise in der Schnittstellendefinition (REST, OpenAPI, Swagger, ...) \n    Routine im Umgang mit Versionsverwaltungssystemen und Build-Pipelines (Git, Gitlab) \n    Freude an agiler Zusammenarbeit \n    Sehr gute Deutschkenntnisse und gute Englischkenntnisse \n",
		"skillList": "typescript, react, rest, graphql, kubernetes, gitlab, cicd, cleancode, oop, vue, angular, cypress, openapi, swagger, git, gitlab, agile",
		"publicationDate": "2022-12-18"
	},
	{
		"id": 20,
		"title": "React Developer",
		"company": "NETCONOMY GmbH",
		"url": "https://www.stepstone.de/stellenangebote--React-Developer-m-f-d-Dortmund-Berlin-NETCONOMY-GmbH--8377095-inline.html?rltr=5_5_25_seorl_m_0_0_0_0_0_0",
		"description": "Your Job\n\n    You contribute in developing high performance web solutions within our agile and cross-functional teams\n    You work across the entire web stack with modern web frameworks such as React, Redux, GraphQL, Node.js, SASS and TypeScript\n    You build experiences for customers by optimizing the usability and UX\n    You effectively support with browser and performance optimization\n    You successfully implement responsive designs and ensure cross-browser compatibility\n    You proactively assist with the evaluation and introduction of innovative frontend technologies\n\nYour Skills\n\n    You have at least 3 years of experience working as a Frontend Developer or in a similar role\n    You have experience / relevant background in web development with Javascript/ES6 (React)\n    You are familiar with a variety of web browsers and their compatibility issues\n    You know how to use modern development tools, such as JIRA, Confluence, Git, Jenkins\n    You have practical experience with accessibility, performance analysis and usability\n    Your knowledge of concepts like Server-Side Rendering and Progressive Web Apps is solid\n    You have excellent English skills (B2/C1), German skills are beneficial\n\n",
		"skillList": "react, redux, graphql, node, sass, typescript, ux, jira, confluence, git, jenkins, ssr, pwa",
		"publicationDate": "2022-12-18"
	},
	{
		"id": 21,
		"title": "TypeScript Developer",
		"company": "meetergo GmbH",
		"url": "https://www.stepstone.de/stellenangebote--TypeScript-Developer-m-w-d-Koeln-meetergo-GmbH--8168170-inline.html?rltr=1_1_25_seorl_m_0_0_0_0_1_0",
		"description": "Bei uns kannst Du Deine großartigen Tech Skills voll zum Einsatz bringen. Sag uns, was Du drauf hast und wir finden gemeinsam mit Dir Deinen Best-fitting-place in unserem agilen Entwickler-Team. Mindestens mit 2 bis 3 der folgenden Technologien solltest Du Dich richtig gut auskennen:\n\n    Modernes Typescript\n    React / NextJS / Remix / Chakra UI / Material UI (Frontend)\n    React Native (Native)\n    NestJS / TypeORM / Postgres (Backend-API)\n    LiveKit (P2P-Videoplattform)\n    WebSockets / Socket.io / Redis / LiveKit SDK (Backend-Realtime-Comms)\n    AWS / Terraform / Docker / Kubernetes (Infrastruktur)\n    Nx (Monorepo)\n    Webpack / Babel / Nx (Build Tools)\n    Gitlab/Circle CI (CI)\n    Jest / React Testing Library / Testcafe / Cypress / Supertest (Testing)\n",
		"skillList": "react, nextjs, remix, typescript, chakraui, mui, reactnative, nestjs, typeorm, postgres, livekit, socketio, redis, aws, terraform, docker, kubernetes, nx, webpack, babel, gitlab, circleci, jest, reacttestinglibrary, testcafe, cypress, supertest",
		"publicationDate": "2022-12-19"
	},
	{
		"id": 22,
		"title": "Softwareentwickler Frontend in DevOps",
		"company": "Deutsche Bahen",
		"url": "https://www.get-in-it.de/jobsuche/p174488?filter[thematic_priority]=5&filter[city][radius]=25&filter[city][city][0][lon]=13.41053&filter[city][city][0][lat]=52.52437&start=0&limit=39&ref=Jobsuche",
		"description": "Du hast ein (Fach-)Hochschulstudium in (Wirtschafts-)Informatik oder einer vergleichbaren Fachrichtung abgeschlossen oder verfügst über eine Ausbildung im IT-Bereich\n    Du bist Experte in der Entwicklung mit JavaScript/TypeScript und React und hast Erfahrung im Umgang mit Komponentenbibliotheken wie Chakra UI\n    Automatisierte Tests, UX und Accessibility sind für dich unverzichtbar neue Technologien setzt du im Sinne der Kundenorientierung zum Wohle der Anwendenden ein\n    Du hast Lust darauf, dein Know how in für ein DevOps-Team wichtigen Themenfeldern wie Continuous Integration und Continuous Delivery auf- und auszubauen\n    Spaß an neuen Technologien, ein hohes Maß an Wissbegierde und Lernbereitschaft zeichnen dich aus und du sprichst fließend Deutsch",
		"skillList": "typescript, react, chakraui, testing, ux, devops, cicd",
		"publicationDate": "2022-12-20"
	}
]